[{"_id":"07103100-5d4d-11ed-87b0-5351775cf8d7","created_at":"2022-11-05T21:01:33.000Z","updated_at":"2022-11-05T21:19:36.000Z","thumbnail":"8b148210-5d4f-11ed-87b0-5351775cf8d7.jpeg","item_type":"car","year":1964,"make":"Porsche","model":"356SC Cabriolet","title":"Clear WA","url_title":"1964-Porsche-356SC-Cabriolet-clear-wa-Q6dh7m7bU","sold":false,"stock":"64POR356SC01","vin":"160170","mileage":73336,"price":179500,"description":"Fully restored, excellent condition 1964 Porsche 356 SC Cabriolet.  A fantastic condition 356 professionally renewed by top restoration specialists with over $140,000 spent for this high quality work.   A  comprehensive, rotisserie metal restoration and refurbishment was completed by Byers Custom & Restoration of Auburn, WA and top-quality subcontracting shops in 2003, including replacing the floor pans, longitudinals,  repairing and aligning the body panels, repainting the exterior in attractive, metallic silver/green similar to Aston Martin Olive Green.   A new, black German canvas soft top and  black leather upholstery was installed.  Chrome wheels with correct hubcaps and quality radial tires are installed. No expense was spared in renewing the car with correct new, restored and re-chromed parts.  Additional photos and video  are presented in this site's photo gallery showing the restored undercarriage,  suspension, chassis, and driveline   \n A replacement 1964 356SC engine was rebuilt to 1.7 liters and installed by Denny Aker,  a leading 356 restoration and engine builder and runs extremely well. Case stamping on third member of case is P☆813334☆ is a correct year and type for a 356SC engine. This SC has a rebuilt four-speed manual transaxle, and is original to the car. Denny Aker and serviced since 1984 by  Aker's Porsche of Seattle, WA.  \nCabin finishes include replacement black leather upholstery with matching door panels, gray carpeting, and Coco floor mats. Lap belts are fitted, Blaupunkt Frankfurt AM/FM/SW restored factory radio, leather steering wheel and other amenities. The body-colored dashboard has restored, VDO instrumentation that includes a 6k-rpm tachometer, a 120mph speedometer, and a combination gauge for oil temperature and fuel level. The five-digit mechanical odometer shows 73,336 believed to be original miles.\nAcquired by the present, private owner in 1984, (believe to be third owner since new),  this beautiful, turn-key  356SC cabriolet is now offered with historical documentation and restoration receipts, restoration photo album, a  Porsche Certificate of Authenticity (COA), and a clean Washington state title. A factory 356 Cabriolet hardtop and factory toolkit  is available from the selling dealer at an additional, reasonable price. Available to view at our showroom in Carnation, WA.\nDetails from Porsche COA:  VIN: 160170  Mfr/Delivery Date:  03/19/1964  Original Engine No. 820759. Transaxel No. 76893  Original Paint Color:  Champagne Yellow/6405.  Interior: Black Leather. Optional equipment: Dunlop Tires, Set of Cocoa-Fiber Mats.\nLocated in Carnation, WA at Giordano''s Vintage Motors. We Buy, Sell, Consign and Trade Sports, Muscle, Collector Cars and Rods, Motorcycles, Parts and collectables. Come visit our indoor showroom or view our inventory online at www.giocars.com. As well as actively buying and trading vehicles, we welcome consigned vehicles, and offer low consignment sales commissions and no consignment fees, putting more money back in your pocket. We are experts at locating and appraising vehicles, and can help value your vehicle for insurance, estate settlement or in preparation for selling. We have hundreds of satisfied customers, and will work hard to earn your trust. You can visit our showroom at 4501 Tolt Avenue, Carnation, WA 98014. Or view our website at: www.giocars.com. You can email us or call Jim at 425-333-5600. We hope to hear from you! VIN posted at dealership.\nThe price for this vehicle as equipped does not include charges such as: License, Title, Registration Fees, State or Local Taxes, Finance Charges, Credit Investigation, Optional Credit Insurance, Physical Damage or Liability Insurance, Delivery Fees, or a negotiable $150 Documentary Service Fee. This website and Dealership makes no representations, expressed or implied, to any actual or prospective purchaser or owner of this vehicle as to the existence, ownership, accuracy, description or condition of this vehicle's listed equipment, accessories, price or any warranties. Any and all differences must be addressed prior to the sale of this vehicle.\n","color":"Metallic Silver-Green","engine":"1964 1.7 Liter Rebuilt 356SC ","transmission":"4spd 356SC ","options":"See description above","item_condition":"Excellent, restored condition"},{"_id":"a88f09e0-97ea-11eb-b224-ade22a8408a3","created_at":"2021-04-07T21:46:07.000Z","updated_at":"2021-04-07T21:46:11.000Z","thumbnail":"aa52d9f0-97ea-11eb-b224-ade22a8408a3.jpeg","item_type":"Cars","year":0,"make":"P908","model":"Spyder","title":" P908/Spyder Tribute: Track Day/Race/Street – Build to Customer Specification. Designed and Constructed by Giordano’s Vintage Motors","url_title":"0-P908-Spyder-p908-spyder-tribute-track-day-race-street-build-to-customer-specification-designed-and-TvPY4YO1t","sold":false,"stock":"","vin":"","mileage":0,"price":109080,"description":" 908/3 Spyder Tribute:  Race/Track/Street - Designed and Constructed by Giordano's Vintage Motos. Our unique P908/3 Spyder Tribute displays our team's capabilities in executing the design and construction of unique vehicles and compnent upgrades for our customers.  Custom steel tube frame designed and fabricated in our shop with driver and passenger positioned well back in the chassis for added safety. Hand built fiberglass Spyder body, with aluminum and fiberglass inner structure.  Our prototype shown in phoot is powered by a Porsche 1973 911 engine built to 2-5 Short Stroke specs in our shop.  We can build with 911 Air Cooled or watercooled Porsche Flat six or V8 engine.  Porsche 5spd transaxel. Fabricatd to race car standards with many unique GVM designed and fabricated components, along with Porsche and other top brand race parts. Wheel options include replicas of the original 5-spoke 908 wheel (not shown). We are designing bodywork with endurance style, street legal lighting.  Orders accepted-built to customer specification\n\nCustom Orders accepted-will build to customer specification.. Display car shown in photos currently available for $109.080","color":"Customer specified including Gulf, MartinI, other racing livery or customer specified paint and interior","engine":"911 Air Cooled or watercooled Porsche Flat six or V8","transmission":"4, 5 or 6spd","options":"built to customer specification","item_condition":""},{"_id":"c793dd70-97ea-11eb-b224-ade22a8408a3","created_at":"2021-04-07T21:46:59.000Z","updated_at":"2021-04-07T21:49:43.000Z","thumbnail":"28588250-97eb-11eb-b224-ade22a8408a3.jpeg","item_type":"Cars","year":1962,"make":"Porsche","model":"356 Super 90","title":" 1962 Porsche 356 Super 90 Coupe-Silver/Black. Significant Restoration of CA Black Plate Car.","url_title":"1962-Porsche-356-Super-90-1962-porsche-356-super-90-coupe-silver-black-significant-restoration-of-ca-black-Y9UWoWLsE","sold":false,"stock":"62P356BS9001","vin":"117795","mileage":0,"price":105995,"description":"Price reflects significant, recently completed restoration work our believed to be matching number Super 90 Coupe. Professionaly  rebuilt, S90 engine and transaxel.  2018-19 work professional underbody restoration.   Currently Silver with black interior but considering installation of a new, red Leather interior. A fast appreciating classic.  Presently price at $ 105,995 \n\nOur `62 Porsche 356B T6 S90 has received siginificant professional restoration-A rare and fun car to own and drive and an appreciating collectable.  The Super 90 engine model is the top of the 356B line, and is a California Black plate and Blue Plate survivor. Previous owner had the engine professionally rebuilt in Los Angeles, CA and built to claimed 120-125 dyno-tested horsepower. The 741 model 356B 4spd transaxel was also rebuilt at that time. Rebuild is many years ago, but few miles since. Body/paint was professionally restored by Steve Huber and has not been rarely driven since. Upper Body was stripped to bare metal, and carefully prepped for paint. Car requires some light, final assembly. Car looks terrific in silver. Has optional speedster aluminum side trim. Work required to complete the car is primarily installing newly powder coated engine tin (correct S90 colors), re-installation of a few components in the dash, install glass, and some trim and other misc. work. This is a very solid, very good condition S90 coupe. ","color":"Silver with Black Interior (new red leather seat and matching red interior planned)","engine":"S90. Number is correctly located in year production range of VIN 117795","transmission":"Rebuilt 4spd Manual","options":"Blaupunkt Frankfurt AM/FM/Shorwave factory radio, Driving lamps, and more.","item_condition":"Very good condition"},{"_id":"6cb4e1f0-feed-11eb-ab0a-83e207626117","created_at":"2021-08-16T23:55:24.000Z","updated_at":"2022-06-13T16:16:58.000Z","thumbnail":"ed433ec0-fef2-11eb-ab0a-83e207626117.jpeg","item_type":"Cars","year":1972,"make":"De Thomaso","model":"Pantera SOLD","title":"Clear WA Title","url_title":"1972-De-Thomaso-Pantera-SOLD-clear-wa-title-cYSAjPAgo","sold":true,"stock":"71PANTERA01","vin":"THPNMB02410","mileage":71999,"price":85995,"description":"Recent SALE:  1972 DE TOMASO PANTERA COUPE CHASSIS NO. THPNMB02410 This early, 1972 Pre-L version with chrome bumpers, a two-pod dash and a rare flat rear decklid is finished in a rare, one year only factory red/orange paint with a black interior. Same enthusiast owner the last 20 years.\n\nView Walk around video at the web link provided in this ad... View Engine start up and run video at:  https://youtu.be/Z7dXwM6pNlM\n\nNote: We will be mounting and balancing a set of 4 used. good condition Radial tires on a set of 7\"and 8\" Factory original Pantera DeTomaso Campagnola  wheels and installing on the car with new photos provided in this ad.soon..The 5 spoke, American Racing wheels shown in photos are retained by the seller and not included in sale.    \n\nPower provided by a mid-mounted 351cu.in. Cleveland V8 matched with the better performing, early close-ratio transmission, both believed to be original to this car. Some minor spares and removed parts and manuals included. A later model header, with original, quad-outlet exhaust system with Ansa tips, aftermarket alum. intake manifold, ribbed valve covers. A Deluxe Marti report is on order. This Pantera is in overall very good, mainly original condition with much better than average unibody condition. The car starts and drives very well, with good power, quiet exhaust, solid brakes and easy shifting. Here are some details from a comprehensive inspection (available in PDF) by Mike Thomas, Pantera owner, restorer, and president of Panteras Northwest: Underside/Chassis: “In general, the underside of the car is in very good condition. No evidence of serious rust was found. Only two minor dents in the outer frame, one on each side, were noted and likely due to attempts to jack the car up from the wrong location. The rear crossmember which typically is in very rough shape due to jacking the car is clean and straight. There does not appear to be any outward rusting of any frame members front to rear. There is some minor rust through of the valence under the radiator as is typical of an early Panteras. but the valence itself is very straight. There is the usual light transmission oil deposits on the bottom of the ZF transmission” . Paint Trim and Body: Paint is very presentable and had a light polishing before the review. No serious blemishes were noted. The stainless trim, bumpers, mirrors, and badging are likewise in a very good, shiny condition. Sighting in the body lines of the car from the front, back and sides does not reveal any twisting or other evidence of accident damage to the structure. A magnet test around the lower half of the car did not reveal any significant body filler or Bondo. The rockers have been repainted at some point with some minor overrun to the body above the rockers rear of the doors. There is no bubbling through on any of the rockers. The pinch welds along the bottom of the rockers are clean and straight, and no telltale rust came out of any of the rocker drain openings. The doors open a bit stiff but smooth, but otherwise open, close and latch as they should. The front and rear decklids open and close/latch smoothly and as expected. Weather seals around the doors and decklids are in good, supple condition. Body gaps are consistent around the car. Many of the usual telltale cracks at the shoulders above the upper edge of the rear deck opening, around the taillights and other places do not appear to be in evidence. All the glass is in good condition. Interior: The interior appears to be original save for installation of an aftermarket stereo head unit with speakers in the doors. There is a good bit of the typical delamination of the dash covering above the heater box and in the pocket above the glove box, but the dash covering is otherwise in very good condition. The original seats show only three very small separations of the outer side bolster from the center section on the driver’s seat bottom and back. This can be easily sewn back together by a competent upholstery shop. The passenger seat is in good condition. Key areas to address: ● Headlights are non-operative: this may only be a relay or blown fuse  Note from dealer: There is an apparent relay or wiring problem. Headlight “doors” open and close via 2 wires that can be contacted to battery terminals -switching wires closes the headlights. ● Steering rack bushing has failed: rack needs to be rebuilt and the outer right bushing replacedDealer Note: This upgrade Bronze bushing is ordered and will be installed before 8/22\n\n● Engine run needs to be sorted and tuned: seemed to run a bit rough on start-up and the choke does not engage to hold idle on cold start. ● Radiator overflow tank needs to be repaired: rust at the bottom:  Dealer Note: This tank was professionally welded/repaired and works fine.  Summary: “This appears to be a very solid car. The body structure top and bottom are very clean and straight with minimal evidence of rust. There has been minor modification for drivability to the engine and suspension. It does show wear and lack of functionality in the usual electrical, mechanical, and cosmetic areas for a 50-year-old Pantera that has been fairly-well cared for and driven. This car appears to be an excellent candidate for either light repairs to begin enjoying now or a full restoration. Early flat-deck pre-L Panteras such as this in solid condition have become rarer than the later models sold under the Ford program\".\n\nA few highlights of the car: * Offered from an enthusiast with 20 years of ownership. * Pacific NW car that has been carefully stored and maintained-The condition indicates this car has been in good hands since new. * In August, 2021 Mike Thomas, an experienced Pantera inspector and restorer and Pantera club president inspected the car. His 4 page report is available in PDF to help the buyer evaluate the car from an expert's inspection notes. Inspection noted the car “ presents very well and is detailed-out nicely.” *This is an excellent example of the 'pre-L' Pantera * The original Factory Pantera 15” Campagnola wheels, intake manifold, painted valve covers and air cleaner. A pair of Pantera manuals are included. This rare Pantera is available to view and inspect at Giordano’s Vintage Motors located in Carnation WA. Offered for sale at $85,995.\n\n\n\nThis vehicle is consigned to Giordano's Vintage Motors. The Company is not making any representations as to the condition and/or the value of this vehicle. Giordano's Vintage Motors has not checked the condition (mechanical or structural), mileage or authenticity of this vehicle and is relying on the information provided by the seller and recent inspection. The company is not responsible for omissions and/or errors in advertising this vehicle and the buyer shall hold the Company harmless from all future claims arising from any representations made by the Seller. All vehicles are sold on an AS-IS, WHERE-IS basis. We Buy, Sell, Consign and Trade Sports, Muscle, Collector Cars and Rods, Motorcycles, Parts and collectables. Come visit our indoor showroom or view our inventory online at www.giocars.com. As well as actively buying and trading vehicles, we welcome consigned vehicles, and offer low consignment sales commissions and no consignment fees, putting more money back in your pocket. We are experts at locating and appraising vehicles, and can help value your vehicle for insurance, estate settlement or in preparation for selling. We have hundreds of satisfied customers, and will work hard to earn your trust. You can visit our showroom at 4501 Tolt Avenue, Carnation, WA 98014. Or view our website at: www.giocars.com. You can email us or call or text Jim at 425-985-4259. We hope to hear from you! VIN posted at dealership. The price for this vehicle as equipped does not include charges such as: License, Title, Registration Fees, State or Local Taxes, Finance Charges, Credit Investigation, Optional Credit Insurance, Physical Damage or Liability Insurance, Delivery Fees, or a negotiable $100 Documentary Service Fee. This website and Dealership makes no representations, expressed or implied, to any actual or prospective purchaser or owner of this vehicle as to the existence, ownership, accuracy, description or condition of this vehicle's listed equipment, accessories, price or any warranties. Any and all differences must be addressed prior to the sale of this vehicle.\n\n","color":"Factory Red Orange","engine":"351","transmission":"5 spd ZF close-ratio transaxel","options":"See Above description","item_condition":"Overall Excellent original condition with some upgrades"},{"_id":"ace331d0-1352-11ed-99bd-6de609337fe1","created_at":"2022-08-03T17:35:32.000Z","updated_at":"2022-08-03T17:36:41.000Z","thumbnail":"d4203540-1352-11ed-99bd-6de609337fe1.jpeg","item_type":"Cars","year":1960,"make":"Volvo","model":"Custom Sports Roadster","title":"2022 WA Title Included","url_title":"1960-Volvo-Custom-Sports-Roadster-2022-wa-title-included-Pv2RmP_JC","sold":false,"stock":"60VOLVCSR01","vin":"","mileage":0,"price":69995,"description":"1960 Volvo Custom Sports Roadster  \n\nCompleted by Giordano’s Vintage Motors (GVM) in 2022 for our client, this unique, hand built, supperlegga constructed steel roadster is now on consignment with our dealership. Below is a description and comments on this custom build.   \n \nBody:Superleggera style construction. ¾ steel tubing with steel body panels welded and riveted to this framing. Overall high quality construction with significant structural upgrading by our shop in the style of period road racing cars. The hand-built steel body and interior is in the style of 50s or 60s Lotus sports racers, and Italian sports and racing cars. The original, steel front-hinged bonnet has custom air scoop and chrome bonnet hold-down pins,  GVM designed and fabricated many aluminum panels in the engine compartment and interior in a vintage race car style.  \n \nFrame/Chassis; The original ladder frame in parts was claimed by previous owner to be from a 1960 Volvo 544.The original suspension, rear end, brakes and steering were also Volvo 544, now upgraded to later Volvo P1800. This frame was cut down to allow lower seat height . Almost all of the frame the rear bulkhead back, including bracing for the fuel cell. and firewall forward (except part of the front frame rails). We fabricated, :1-1/2 steel tubing to support the frame and provide passenger and driver side impact protection. Steel bracing and aluminum cladding in the style of period road racing cars was fabricated. . \n \nDrivetrain: The car is powered by a Volvo P1800 B20  2 liter inline 4 engine professionally built by Autosport of Seattle with all stock with a D cam high end rebuild with break-in miles only. engine Engine was completely re-machined with replacement valves, new bearings,  gaskets and an upgraded front cover and seal system to prevent leaks common with this engine.  Fuel system included a new fuel cell, dual, OEM Italian Weber 40 DCOE carburetors  and new Volvo sports Intake manifold.  The transmission is a factory P1800 four-speed overdrive manual. The overdrive is currently not activated and is bypassed. Fuel system new proximally 10 gallon fuel cell. Electric feel pump. 1960s Corvette Radiator. New Dodge colt rack and pinion steering system, Steering column is an aftermarket custom unit. New period style gauges. Push button starter. Racing style electrical shut off switch. New clutch kit hoses. \n \nSuspension and Brake system.  Front suspension is “modern”, Volvo 740 including lower control arms, spindles.disk brakes and adjustable, coil over front struts. \nFour link rear suspension utilizes a Volvo P1800 narrowed, axel assembly, new axles, adjustable coil springs with KYB performance shocks and rebuilt P1800 disc brakes.  Custom parking brake with leather boot. \n \nWheels are Volvo 15 inch steel wheels in the style of 1950s Jaguar racers. . \nThe custom exhaust system includes ceramic coated tube headers with full stainless exhaust system-a single piper splits to dual pipes coming out the back. Not installed on the car presently but included with this car is a custom, stainless steel rear bumper.. This bumper is included with the car and will require removal of the tail lamps where the bumper mounting frame mount is located.   \n \nInterior: The interior design was designed similar to 1950s Ferrari sports cars. Our client requested a vintage race car style which fit the body of the car. The custom built interior by GVM and Jimmy’s Upholstery features custom built leather seats, headrest, quilted door and side panels with side pockets for map sunglasses etc. and rear bulkhead panels with quilted panels carried through into the engine compartment.  Wood Steering wheel, aluminum center dash new carpeting with leather in vinyl edging  \n\nUpgrades added to the car by GVM include all new wiring with new  electrical panels, switches and guages. New fuel-cell and removable, steel access body cover, stainless roll hoop, drivers rear Cowel with leather headrest with hidden storage compartment with interior actuated latch assembly. (note in photos we did not have headrest latched and its popped up at rear). Four-point safety belt system with quick relase, cam locks.  \n\nOther detailing and features include custom-made, Tail lamp assemblies with aluminum housing with Austin Healey glass lenses.  Custom aluminum windshield frame with GVM0built alloy side supports Lexan windshield, and Porsche 356 Speedster aero mirror. Steel front mesh front grill. A variety of vintage and new Volvo badging and emblems are included but not installed on the car.  \n\nThis is a stylish, one of a kind, custom sports car that is fun to drive, and would be a special car in an enthusiast’s collection. Clear, WA State USA title in our dealership name.  The car is ready to ship worldwide.  ","color":"Red","engine":"Freshly rebuilt Volvo P1800 2 liter with dual Webers","transmission":"Volvo P1800 4spd manual with overdrive","options":"See Description above","item_condition":"Prefessionally built, custom roadster completed in 2022"},{"_id":"3b6bc780-97eb-11eb-b224-ade22a8408a3","created_at":"2021-04-07T21:50:13.000Z","updated_at":"2021-06-06T21:38:19.000Z","thumbnail":"583d8e70-97eb-11eb-b224-ade22a8408a3.jpeg","item_type":"Cars","year":1969,"make":"Porsche","model":"911","title":"SOLD","url_title":"1969-Porsche-911-sold-X5HSgDTfm","sold":true,"stock":"69POR911TAUB01`","vin":"","mileage":0,"price":67500,"description":"\nSOLD    1969 Porsche 911T Coupe with 911S options.  911 S appearance group believed to be factory installed, including desirable, 911S gauges and instruments, S Front Aluminum Brake system,  S side deco and S front and rear bumper deco/ trim package, and front and rear sway bars.  Porsche uncurbed, original, Fuchs Alloy wheels, Previous owner said rebuilt engine with 911 Carrera Hydraulic chain tensioner upgrade, and believed to have upgraded internals.   PPI performed on 12/28/2020 indicated the compression is high and even at 160+-170, which is higher than std 150-155lb for T Spec engine. During this PP1 a leak down test was performed with all cylinders between 6-10%.    Weber Carbs,  Believed to be matching number Engine.  This 911 is in good running order, recent service, and has excellent, original appearance with a professional repaint to correct, original Aubergine/Maroon color with under 50 miles since repaint. Excellent original interior. Superb condition, very solid and straight body with believed to be all original, and very good condition sheetmetal throught,  Modern Stereo / Sound systems with CD, multiple Under dash accessory speaker panel. Recently serviced. Strong running, fast car. - Ready to drive and enjoy and in collectable condition.\n\nLocated in Carnation, WA at Giordano''s Vintage Motors. We Buy, Sell, Consign and Trade Sports, Muscle, Collector Cars and Rods, Motorcycles, Parts and collectables. Come visit our indoor showroom or view our inventory online at www.giocars.com. As well as actively buying and trading vehicles, we welcome consigned vehicles, and offer low consignment sales commissions and no consignment fees, putting more money back in your pocket. We are experts at locating and appraising vehicles, and can help value your vehicle for insurance, estate settlement or in preparation for selling. We have hundreds of satisfied customers, and will work hard to earn your trust. You can visit our showroom at 4501 Tolt Avenue, Carnation, WA 98014. Or view our website at: www.giocars.com. You can email us or call Jim at 425-333-5600. We hope to hear from you! VIN posted at dealership.\n\nThe price for this vehicle as equipped does not include charges such as: License, Title, Registration Fees, State or Local Taxes, Finance Charges, Credit Investigation, Optional Credit Insurance, Physical Damage or Liability Insurance, Delivery Fees, or a negotiable $100 Documentary Service Fee. This website and Dealership makes no representations, expressed or implied, to any actual or prospective purchaser or owner of this vehicle as to the existence, ownership, accuracy, description or condition of this vehicle's listed equipment, accessories, price or any warranties. Any and all differences must be addressed prior to the sale of this vehicle.\n\nVehicle Details\n\nListing ID:CC-1336687\nPrice:$67,500\n \nLocation:carnation, Washington\nYear:1969\nMake:Porsche\n  ","color":"Aubergine","engine":"911 with upgrades and rebuilt by previous owner","transmission":"5 speed","options":"S Options including Factory S Appearance Group, S Brakes, Sway bars, Fuchs Alloy wheels and much more","item_condition":"Overall Excellent"},{"_id":"9fbb9980-97ec-11eb-b224-ade22a8408a3","created_at":"2021-04-07T22:00:11.000Z","updated_at":"2021-04-07T22:00:14.000Z","thumbnail":"a0d37220-97ec-11eb-b224-ade22a8408a3.jpeg","item_type":"cars","year":1954,"make":"Flexible ","model":"Visicoach Historic Tour Bus RV ","title":"Original Mount Rainier National Park Tour Bus","url_title":"1954-Flexible-Visicoach-Historic-Tour-Bus-RV-original-mount-rainier-national-park-tour-bus-4jAV-fiMN","sold":false,"stock":"54FlexVis01","vin":"30733","mileage":0,"price":59995,"description":"\nOriginal Mount Rainier National Park Tour Bus\n\nRARE Scenic Roof Sightseer Windows  This unique and well documented Mt. Rainer Natl. Park tour bus has a significant history in the Northwest, transporting countless visitors to Paradise and other park locations. Historic enough for a museum, this bus carries a unique story and a history of cherished memories and would be welcome and enjoyed by many if used as a tour bus or RV.. Owner's Description Follows:\n\nBased on VIN history, this is 1 of 2 Mt Rainier National Park tour busses and the other is unknown if it still exists. As seen in the photos, there is an original park brochure and 3 post cards displaying the bus. The destination scroll includes \"Seattle, Tacoma, Sunrise (Lodge), Paradise (Lodge), Special and Rainier Nat’l Park.\"\n\nConverted to an RV Motorhome in 1972. Original blueprints for conversion included.\nOwner's Description Below:\n\nCaterpillar 1150 Diesel\n4 Speed manual with 2 speed rear end.\nBoth motor and trans have recently been gone through with various updates & repairs. \nAll new batteries. \nAll new wheels and tires. (6)\nOnan generator serviced and runs well. However last trip, a gas leak began at one of the valves. Minor repair needed, easy access. \nGas stove works great. \nRefrigerator and freezer work great. \nWater, and shower unknown as I never tried them, water pump activates... \nToilet flushes, flush valve sticks. (this is the reason I haven't run the water further)\nFresh water and black water holding tanks seem to be complete and holding residual water with no leaks. \nHeadlights / taillights work. \nMarker lights (roof corners) currently disconnected. \nFront and rear electric heaters work. \nMany outlets not working. \nWindshield wipers work - need new blades. \nRoof a/c works\nAir horns work great and sound like a train lol! \nNew 30 amp power cord wired in, powers the coach great. \n\nThere are additional pieces of glass which I believe are spare windshields. There are also the rest of the original scenic window shades. Included are various additional interior and exterior trim pieces etc.\n\nRegistration / documented owner history following Mt Rainier National Park, dated back to 1972 (or earlier). Many original owners manuals and diagrams plus handwritten driver logs.\n\nThe remaining roof scenic windows are one of the most rare and unique things about this bus and one of my favorite features!\n\nReason for selling: We are a larger family with 5 children and need a motorhome large enough for traveling. We have determined it just is not realistic to make this work for us.\n\nNeeds: Overall the “bones” of this bus are very decent. There are areas of rust. A few of these spots are significant. Most are surface.\n\nIdeal candidate for motorhome, tour bus, tiny home, mobile espresso and so many other uses!\n\nCurrently stored indoor, RV Garage. Located in Woodinville WA. \nOffered at $ 59,995\n\n​Contact Jim Giordanoe at 425.985 4259\n\nLocated in Carnation, WA at Giordano''s Vintage Motors. We Buy, Sell, Consign and Trade Sports, Muscle, Collector Cars and Rods, Motorcycles, Parts and collectables. Come visit our indoor showroom or view our inventory online at www.giocars.com. As well as actively buying and trading vehicles, we welcome consigned vehicles, and offer low consignment sales commissions and no consignment fees, putting more money back in your pocket. We are experts at locating and appraising vehicles, and can help value your vehicle for insurance, estate settlement or in preparation for selling. We have hundreds of satisfied customers, and will work hard to earn your trust. You can visit our showroom at 4501 Tolt Avenue, Carnation, WA 98014. Or view our website at: www.giocars.com. You can email us or call Jim at 425-333-5600. We hope to hear from you! VIN posted at dealership.\n\nThe price for this vehicle as equipped does not include charges such as: License, Title, Registration Fees, State or Local Taxes, Finance Charges, Credit Investigation, Optional Credit Insurance, Physical Damage or Liability Insurance, Delivery Fees. This website and Dealership makes no representations, expressed or implied, to any actual or prospective purchaser or owner of this vehicle as to the existence, ownership, accuracy, description or condition of this vehicle's listed equipment, accessories, price or any warranties. Any and all differences must be addressed prior to the sale of this vehicle.\n\nPrice: $64,995   This car is being marketed for the private seller on a marketing agreement contract - not consigned to our dealership.  The purchase of the car will be through the private owner and all funds and purchase agreement will be directly between buyer and seller.  We are assisting buyer and seller to market this car and assist in communication, paperwork and shipping. ","color":"Red / Stainless Steel","engine":"Caterpillar 1150 Diesel\n","transmission":"4 Speed manual with 2 speed rear end.","options":"See description Above","item_condition":"Good Overall Condition"},{"_id":"16f5dde0-97ec-11eb-b224-ade22a8408a3","created_at":"2021-04-07T21:56:22.000Z","updated_at":"2021-04-07T21:56:44.000Z","thumbnail":"18d9e020-97ec-11eb-b224-ade22a8408a3.jpeg","item_type":"Cars","year":1964,"make":"Devin","model":"Devin SS Tube Frame ASM Drag Racer/Street 396 FI","title":"","url_title":"1964-Devin-Devin-SS-Tube-Frame-ASM-Drag-Racer-Street-396-FI--KNnpl5VsP","sold":false,"stock":"64DEVINASMRACER","vin":"","mileage":0,"price":59995,"description":"Price is for completed car. 1964 Devin-Corvette A Sports Modified Street/Drag Coupe. Under re-construction at our shop. Race/Track/Street - Under re-construction in our shop. Our unique 1964 Devin-Corvette rebuild and upgrade and repowering highlights our team's capabilities in executing the design and construction of unique vehicles and compnent upgrades for our customers. Built to drag race in the 1960s in the ASM racing class, this well designed steel tube frame car was built using 1964 Corvette components: 327 Corvette engine and trans, dash, guages etc. We have repowered the car with a rebuilt, 1967 Chevrolet 396 engine using a period Hilborne mechanical fuel injection system with high rise chrome stacks to our own design electronic fuel injection system - retaining the wild Hilborn Dragster look with flexible, reliable fuel delivery for street or track. We have extensively upgrades the original steel tube frame for added safety and driveability. Features included Wilwood 4 wheel power disk brakes, GM 12 Bolt narrowed rear with custom rear suspension, coil over front suspension with modern steering rack, automatic transmission and fuel cell. We are restoring the original, Devin fiberglass body with steel roof, steel doors with rollup windows, and aluminum and fiberglass inner structure. One of 3 known Big Body/Devin SS coupe conversion bodies. Our plan is to create a custom 1970s look two tone metalflake paint scheme with custom period graphics, or we can paint to customers requirements. An exciting and unique car that will be ready for the street, nostalgic drags, car show and events in early 2019.\nLocated in Carnation, WA at Giordano''s Vintage Motors. We Buy, Sell, Consign and Trade Sports, Muscle, Collector Cars and Rods, Motorcycles, Parts and collectables. Come visit our indoor showroom or view our inventory online at www.giocars.com. As well as actively buying and trading vehicles, we welcome consigned vehicles, and offer low consignment sales commissions and no consignment fees, putting more money back in your pocket. We are experts at locating and appraising vehicles, and can help value your vehicle for insurance, estate settlement or in preparation for selling. We have hundreds of satisfied customers, and will work hard to earn your trust. You can visit our showroom at 4501 Tolt Avenue, Carnation, WA 98014. Or view our website at: www.giocars.com. You can email us or call Jim at 425-985-4259. We hope to hear from you! VIN posted at dealership.\nThe price for this vehicle as equipped does not include charges such as: License, Title, Registration Fees, State or Local Taxes, Finance Charges, Credit Investigation, Optional Credit Insurance, Physical Damage or Liability Insurance, Delivery Fees, or a negotiable $100 Documentary Service Fee. This website and Dealership makes no representations, expressed or implied, to any actual or prospective purchaser or owner of this vehicle as to the existence, ownership, accuracy, description or condition of this vehicle's listed equipment, accessories, price or any warranties. Any and all differences must be addressed prior to the sale of this vehicle.","color":"Now White-Blue-Green Metallic Planned","engine":"396 Hillborn EFI Conversion","transmission":"","options":"","item_condition":"Under Construction - Pro Built Vintage car with updates. "},{"_id":"1c6dbfd0-97ed-11eb-b224-ade22a8408a3","created_at":"2021-04-07T22:03:40.000Z","updated_at":"2021-04-07T22:04:03.000Z","thumbnail":"292bed00-97ed-11eb-b224-ade22a8408a3.jpeg","item_type":"Cars","year":1969,"make":"Porsche","model":"911T SOLD","title":"Recently SOLD  1969 Porsche 911T Coup","url_title":"1969-Porsche-911T-SOLD-recently-sold-1969-porsche-911t-coup-1Guvci1so","sold":false,"stock":"60POR911T03","vin":"119100259","mileage":0,"price":53995,"description":"Just SOLD! ","color":"Red - Originally Dunkelgruen Metallic green","engine":"1969 911T Engine. Recent engine work and complete engine compartment restoration and detailing.","transmission":"5spd","options":"","item_condition":"Very solid original condition with partial, light restoration"},{"_id":"b9d2dee0-97ed-11eb-b224-ade22a8408a3","created_at":"2021-04-07T22:08:04.000Z","updated_at":"2022-06-13T02:36:41.000Z","thumbnail":"43e58160-3103-11ec-9c80-cb814ff8b75b.jpeg","item_type":"Cars","year":1973,"make":"Datsun","model":"240Z","title":"1973 Datsun 240Z – Rebuilt, Weber-Carbed Engine. Originally Orange, now ’73 Lime Green. Nice Car","url_title":"1973-Datsun-240Z-1973-datsun-240z-rebuilt-weber-carbed-engine-originally-orange-now-73-lime-Q6cK8EECp","sold":false,"stock":"73DAT240Z01","vin":"HLS30-143598","mileage":71480,"price":39995,"description":"Seller’s Description:\n1973 Datsun 240Z – Rebuilt, Weber-Carbed Engine. Competition Orange, (original Factory color) 71,842 miles\n\nRebuilt Engine with Weber Carbs Cylinder head replaced with earlier, better 1971 240Z cylinder head. Sale includes a set of 4 now vintage Slotted Aluminum wheels with older radial tires shown in a couple earlier photos, Hitachi/Datsun Am Fm stock radio and other spare parts and a repair manual. \n\nDesirable last-year 240Z Classic Japanese Sports car.  Terrific condition body with excellent panel gaps and fit; Very Straight, sound condition with only minor flaws in original dash, new seats covers and carpeting etc.\nA solid, desirable 1973 model. Currently 1973 240Z line green, but engine compartment and interior body of car is original excellent orange paint - easy repaint to this original color.\n\n1973 Datsun 240Z with a rebuilt Engine, 4-speed manual trans.\n\nHere are notes from long time, previous owner: \" This car has not been a an occassional, daily driver for about 15 years. I have driven it around the block one or twice a year and recently drained the tank and put new gas in it. Less than 1000 miles since comprehensive engine rebuild. Rebuild included hot tanking, cylinder honing, new pistons/rings, bearings, crank polishing/balancing, oil pump, complete timing chain kit, rebuilt 1971 240Z head ( 71 head has higher compression than 73 head, also has steel seats instead of brass). Rebuilt alternator, water pump, starter. driver \"I'm not the original owner but as far as I can tell, the car has never been in even a minor accident. I did have it painted years ago. Car was sanded to bare metal or original primer. Some minor dent repair done in various spots. Car was originally the competition orange color. Yellow/green paint now is matched to a factory original color. Floor pans have been restored with a procedure of grinding rust out and brush applying a anti-rust primer. Suspension strut cartridges were replaced with KYB shocks. This was many years ago but probably on have 5000 miles on them.. Exhaust was replaced at time of engine rebuild with a header, Wolverine Glaspak, and resonator/muffler. The clutch was also replaced at the time of the engine rebuild. I replaced the pressure plate, clutch disk and throwout bearing. Front ball joints have been replaced. Steering is pretty tight unlike most 240z. Front end is very stable on the freeway. Much brake work was done but again it was many years ago. Front disks were turned as well as rear drums. I just replaced the rear wheel cylinders as they didn't survive the extended garaging. The brake lines also got a good flush. As you can see by the pictures the original side-draft dashpot carbs are not on the car. I retrofited the carbs with the 240Z weber upgrade kit. I still have the old dashpots and linkages if you want to restore back to original. I also have the original 1973 head along with a bunch of other misc. parts. Even a spare back glass.\" Note: These notes from long-term owner was written years ago before I purchased the car. Current price reflects recent work and significant increase in market value in similar condition 240Zs.\n\nI can ship the car worldwide at affordable Prices. Email [Email Dealer] or call Jim Giordano at 001-425-985-4259\n\nLocated in Carnation, WA at Giordano''s Vintage Motors. We Buy, Sell, Consign and Trade Sports, Muscle, Collector Cars and Rods, Motorcycles, Parts and collectables. Come visit our indoor showroom or view our inventory online at www.giocars.com. As well as actively buying and trading vehicles, we welcome consigned vehicles, and offer low consignment sales commissions and no consignment fees, putting more money back in your pocket. We are experts at locating and appraising vehicles, and can help value your vehicle for insurance, estate settlement or in preparation for selling. We have hundreds of satisfied customers, and will work hard to earn your trust. You can visit our showroom at 4501 Tolt Avenue, Carnation, WA 98014. Or view our website at: www.giocars.com. You can email us or call Jim at 425-333-5600. We hope to hear from you! VIN posted at dealership.\n\nThe price for this vehicle as equipped does not include charges such as: License, Title, Registration Fees, State or Local Taxes, Finance Charges, Credit Investigation, Optional Credit Insurance, Physical Damage or Liability Insurance, Delivery Fees, or a negotiable $100 Documentary Service Fee. This website and Dealership makes no representations, expressed or implied, to any actual or prospective purchaser or owner of this vehicle as to the existence, ownership, accuracy, description or condition of this vehicle's listed equipment, accessories, price or any warranties. Any and all differences must be addressed prior to the sale of this vehicle.\n\n\n","color":"Competition Orange","engine":"2.4 Liter inline6 with Dual Weber Carbs","transmission":"4 spd ","options":"See description","item_condition":"Overall Very good condition.  Recent work 2020-21"},{"_id":"5d5ea860-97ed-11eb-b224-ade22a8408a3","created_at":"2021-04-07T22:05:29.000Z","updated_at":"2022-06-13T16:18:00.000Z","thumbnail":"694dc5c0-97ed-11eb-b224-ade22a8408a3.jpeg","item_type":"Cars","year":1936,"make":"Rover","model":"14 Sports Saloon P2","title":"1936 Rover 14 Sports Saloon P2","url_title":"1936-Rover-14-Sports-Saloon-P2-1936-rover-14-sports-saloon-p2-T8uLeDtb1","sold":false,"stock":"","vin":"622315","mileage":0,"price":36995,"description":"Highlights:\n\nCharming 30`s Rover with modern mechanicals\nProfessional, comprehensive restoration\nTop to bottom, a stunning car you can drive anywhere-ultra reliable and easy to service!\n\nA captivating, British sports saloon capable of touring long distances comfortably. It has received many FIRST IN CLASS & BEST OF SHOW awards. Up grades include a GM ohv 4 cylinder 95 hp motor, 5-speed transmission, a Toyota rear axle, new upholstery, new electric fuel pump, newer www Firestones, new gas tank liner, new ball joints & 12 volt battery (2005). Paint is in very good condition. All interior wood is restored English rosewood. The chrome is especially nice.  A wonderful sliding sun roof makes the car a pleasant touring car and the interior is always cool. All manuals & much literature is included. The restoration has been carefully & professionally done so as to preserve the appearance of an original 1936 Rover.  An exceptional, rare and charming classic you can reliably drive anywhere. $ 36,995 Trades Welcome!","color":"Dark Blue/black Fenders/Blue Interior","engine":"Chevrolet 2.5 Liter 4 cylinder - S10","transmission":"Chevrolet S10 5spd Manual","options":"Professional Resto w/Chevrolet Conversion. Toyota Rear end","item_condition":"Superb, Restored Condition"},{"_id":"c3e944a0-97ed-11eb-b224-ade22a8408a3","created_at":"2021-04-07T22:08:21.000Z","updated_at":"2021-04-07T22:08:24.000Z","thumbnail":"c4fb9f00-97ed-11eb-b224-ade22a8408a3.jpeg","item_type":"Cars","year":1980,"make":"Porsche","model":"911SC","title":"SOLD:  1980 911sc Targa SOLD Minerva Blue.","url_title":"1980-Porsche-911SC-sold-1980-911sc-targa-sold-minerva-blue-5_j1SvjY1","sold":true,"stock":"SOLD","vin":"80P911SCTARMIN01","mileage":0,"price":27995,"description":"SOLD\n\nVIN:  91A0140826     Build Date: 10/79   (826 911SC built for 1980 model year)\n\nSOLD\nLocated in Carnation, WA at Giordano''s Vintage Motors. We Buy, Sell, Consign and Trade Sports, Muscle, Collector Cars and Rods, Motorcycles, Parts and collectables. Come visit our indoor showroom or view our inventory online at www.giocars.com. As well as actively buying and trading vehicles, we welcome consigned vehicles, and offer low consignment sales commissions and no consignment fees, putting more money back in your pocket. We are experts at locating and appraising vehicles, and can help value your vehicle for insurance, estate settlement or in preparation for selling. We have hundreds of satisfied customers, and will work hard to earn your trust. You can visit our showroom at 4501 Tolt Avenue, Carnation, WA 98014. Or view our website at: www.giocars.com. You can email us or call Jim at 001-425-333-5600. We hope to hear from you! VIN posted at dealership. \n\nI can ship the car worldwide at affordable Prices. Email [Email Dealer] or call Jim Giordano at 001-425-985-4259","color":"Minerva Blue Metallic (#304-9-3) Tan Leather","engine":"","transmission":"5 spd Manual","options":"See description","item_condition":""},{"_id":"111efcf0-97f4-11eb-b224-ade22a8408a3","created_at":"2021-04-07T22:53:28.000Z","updated_at":"2021-08-12T00:55:13.000Z","thumbnail":"39a7d240-fb05-11eb-a3b4-179c4fa6e7a8.jpeg","item_type":"Cars","year":1967,"make":"Chrysler","model":"Barracuda Hardtop","title":"Clear WA Title","url_title":"1967-Chrysler-Barracuda-Hardtop-clear-wa-title-lw_-S02dH","sold":false,"stock":"67BARRACUDA-01","vin":"","mileage":0,"price":24995,"description":"1967 Plymouth Barracuda Harttop.  Update:  This car presently is at a professional, Autobody and Paint shop having drivetrain removed, media blasting planned for entire body and engine compartment, repaint to Hemi Orange and plan is to repower with a late model, Mopar Hemi V8 and appropriate, matching transmission, update the interior, suspension, brakes, and create an exciting restomod.  Project may be available to sell as a roller and buyer at this point can pick their paint color...we are contracted to have them complete the car as a painter roller...Now back to where the car was before we started this work.... Later 1977? Slant 6 with Automatic.  Nice driver with exterior body soda blasted/stripped to bare metal - and sat in carport where some flash rust occurred, in Oct 2020 our shop DA'ed most of the car to pretty much bare metal ( car is still running and driving).  Price includes car being professionally painted with quality sealer primer.  Great candidate for V8 sway, but a super solid, low rust car to keep stock and enjoy the car with this drivetrain.  More photos when in primer.  Trunk is full of the cars trim, lamps and other parts removed from the car for paint stripping.  98044 indicated miles believe to be original. Includes shop manual, and some spares.  \n\nThis Vehicle is owned by the Company, however, the Company is not making any representations as to the condition, authenticity, mileage or originality of this vehicle. The Company is not issuing any warranties, verbal or written and is not responsible for any omissions or errors in advertising. The Customer is relying solely on the previous owners information and/or its own inspection, knowledge and judgment on this vehicle. The Company is not a certified mechanic or appraiser.  All vehicles are sold on an AS-IS, WHERE-IS basis ","color":"Originally Copper Metallic with black interior","engine":"I6","transmission":"Auto","options":"See description above","item_condition":"Original, needing restoration"},{"_id":"4b4c2a00-97f0-11eb-b224-ade22a8408a3","created_at":"2021-04-07T22:26:27.000Z","updated_at":"2021-04-07T22:26:39.000Z","thumbnail":"51e9e3c0-97f0-11eb-b224-ade22a8408a3.jpeg","item_type":"Cars","year":1958,"make":"BMW","model":"Isetta 300 SOLD","title":"Recent SALE   1958 BMW Isetta 300- Dry Climate Survivor ","url_title":"1958-BMW-Isetta-300-SOLD-recent-sale-1958-bmw-isetta-300-dry-climate-survivor-rBCmq0pBu","sold":false,"stock":"58BMWIST01","vin":"","mileage":0,"price":23950,"description":"Recent SALE  - We are selling a 1957 Isetta project for restoration.   Electric/EV conversion bid available!","color":"","engine":"","transmission":"","options":"","item_condition":""},{"_id":"08472690-5fb6-11ec-b9b3-ef0b427217ea","created_at":"2021-12-18T03:53:16.000Z","updated_at":"2021-12-18T03:53:28.000Z","thumbnail":"0ec57170-5fb6-11ec-b9b3-ef0b427217ea.jpeg","item_type":"car","year":1973,"make":"Porsche","model":"914 2.0","title":"clear","url_title":"1973-Porsche-914-2-0-clear-suFZT2J_Y","sold":false,"stock":"73POR914-2.0","vin":"4732924049","mileage":52052,"price":22950,"description":"Fresh professional repaint in original L30-E Red color in July , 2021. And other interior and misc work completed. We are offering our very oriiginal, 1973 Porsche 914/4 2.0L matching coupe in factory Red paint with black interior. This is a very solid, original Western USA dry climate survivor in overall very good condition. Excellent condition body/chassis. Some damage to Hood, but have a replacement available. Alloy Wheels, Fuel Injected 2 Liter engine. Bosch injection system needs tuneup or service as car runs somewhat rought at idle primarily. A very good, solid original car. Car has desirable Porsche 914  Appearance Group options.\n\nWe are offering our very oriiginal, 1973 Porsche 914/4 2.0L matching coupe in factory Red paint with black interior. This is a very solid, original Western USA dry climate survivor in overall very good condition.  Excellent condition body/chassis.  Some damage to Hood, but have a replacement available.  Alloy Wheels, Fuel Injected 2 Liter engine. Bosche injection system needs tuneup or service as car runs somewhat rought at idle primarily. A very good, solid original car.   Believed to have the Appearance Group options.\n\nLocated in Carnation, WA at Giordano''s Vintage Motors. We Buy, Sell, Consign and Trade Sports, Muscle, Collector Cars and Rods, Motorcycles, Parts and collectables. Come visit our indoor showroom or view our inventory online at www.giocars.com. As well as actively buying and trading vehicles, we welcome consigned vehicles, and offer low consignment sales commissions and no consignment fees, putting more money back in your pocket. We are experts at locating and appraising vehicles, and can help value your vehicle for insurance, estate settlement or in preparation for selling. We have hundreds of satisfied customers, and will work hard to earn your trust. You can visit our showroom at 4501 Tolt Avenue, Carnation, WA 98014. Or view our website at: www.giocars.com. You can email us or call Jim at 425-333-5600. We hope to hear from you! VIN posted at dealership.\n\nThe price for this vehicle as equipped does not include charges such as: License, Title, Registration Fees, State or Local Taxes, Finance Charges, Credit Investigation, Optional Credit Insurance, Physical Damage or Liability Insurance, Delivery Fees, or a negotiable $100 Documentary Service Fee. This website and Dealership makes no representations, expressed or implied, to any actual or prospective purchaser or owner of this vehicle as to the existence, ownership, accuracy, description or condition of this vehicle's listed equipment, accessories, price or any warranties. Any and all differences must be addressed prior to the sale of this vehicle.","color":"Red","engine":"Factory 2.0 FI Engine","transmission":"5 spd manual","options":"Factory Appearance group options, factory alloy wheels, radio and more","item_condition":"Excellent"},{"_id":"5cd280d0-4da7-11ed-a432-2bad2b4abf6f","created_at":"2022-10-16T23:07:53.000Z","updated_at":"2022-10-16T23:25:01.000Z","thumbnail":"e272eb20-4da8-11ed-a432-2bad2b4abf6f.jpeg","item_type":"Cars","year":1949,"make":"Ford","model":"F1 Panel Delivery","title":"Clear WA Title","url_title":"1949-Ford-F1-Panel-Delivery-clear-wa-title-zvBMnScPX","sold":false,"stock":"49FORDPD01","vin":"97HC315177","mileage":0,"price":18995,"description":"New to market!  Rare 1949 Ford F1 Panel Delivery Truck - A dry climate survivor grocery delivery vehicle updated with new Baby Moon style alloy wheels, satin black repaint with red details and more.  The body is overall in very good, low rust condition. Interior is still original blue paint. Update \"street rod\" style aluminum baby Moon style wheels and radial tires.  This Panel has had careful service and light restoration and is ready to enjoy or build your  own custom interior. Sale includes quality, grey leather bucket seats, spares, and factory service manual.   View Walk around and brief driving video at: \nhttps://youtu.be/s5ENumwaHQ8","color":"Black/Red","engine":"Inline 6 Cylinder Ford engine with Ford 3 spd manual transmission. ","transmission":"3 spd","options":"See description above","item_condition":"Overall very good condition"},{"_id":"4648a350-6de4-11ed-8b0a-23167108da04","created_at":"2022-11-26T23:44:31.000Z","updated_at":"2022-11-26T23:45:06.000Z","thumbnail":"55f3de50-6de4-11ed-8b0a-23167108da04.jpeg","item_type":"Motocycles","year":1955,"make":"BMW","model":"R50/2","title":"Clear WA","url_title":"1955-BMW-R50-2-clear-wa-y4sMTQ_O-","sold":false,"stock":"55BMWR501","vin":"557472","mileage":13201,"price":18995,"description":"1957 BMW R50/2 - Classic BMW with Earl's Forks and setup for sidecar use. Presently having replacement  0-Mile, R60 engine professionally rebuilt and other restoration by BMW restoration specialty shop, Matching number engine included (case needs repair). Lots of valuable engine and other spares included. Original 2 Person seat included. Very nice condition, inlcluding paint, trim.  Great looking German classic Motorcycles\n\nWe can ship the car worldwide at affordable Prices. Email [Email Dealer] or call Jim Giordano at 001-425-985-4259\n\nLocated in Carnation, WA at Giordano''s Vintage Motors. We Buy, Sell, Consign and Trade Sports, Muscle, Collector Cars and Rods, Motorcycles, Parts and collectables. Come visit our indoor showroom or view our inventory online at www.giocars.com. As well as actively buying and trading vehicles, we welcome consigned vehicles, and offer low consignment sales commissions and no consignment fees, putting more money back in your pocket. We are experts at locating and appraising vehicles, and can help value your vehicle for insurance, estate settlement or in preparation for selling. We have hundreds of satisfied customers, and will work hard to earn your trust. You can visit our showroom at 4501 Tolt Avenue, Carnation, WA 98014. Or view our website at: www.giocars.com. You can email us or call Jim at 425-333-5600. We hope to hear from you! VIN posted at dealership.\n\nThe price for this vehicle as equipped does not include charges such as: License, Title, Registration Fees, State or Local Taxes, Finance Charges, Credit Investigation, Optional Credit Insurance, Physical Damage or Liability Insurance, Delivery Fees, or a negotiable $100 Documentary Service Fee. This website and Dealership makes no representations, expressed or implied, to any actual or prospective purchaser or owner of this vehicle as to the existence, ownership, accuracy, description or condition of this vehicle's listed equipment, accessories, price or any warranties. Any and all differences must be addressed prior to the sale of this vehicle.","color":"black","engine":"R60 - Fresh Prof. rebuilt with no miles. Original R50 Engine included...apart with damaged case...not quite complete. Other spares included in sale. ","transmission":"manua;","options":"Original R50 Engine included...apart with damaged case...not quite complete. Other spares included in sale. ","item_condition":"Very Good"},{"_id":"59942b80-97f0-11eb-b224-ade22a8408a3","created_at":"2021-04-07T22:26:51.000Z","updated_at":"2021-04-07T22:26:56.000Z","thumbnail":"5bebd720-97f0-11eb-b224-ade22a8408a3.jpeg","item_type":"","year":1978,"make":"Volkswagen","model":"Riviera","title":"1978 VW Riviera Camper Bus – Mechanically Restored, Partial Costmetic Restoration and Excellent Original condition","url_title":"1978-Volkswagen-Riviera-1978-vw-riviera-camper-bus-mechanically-restored-partial-costmetic-restoration-and-_oW2Ebq03","sold":false,"stock":"","vin":"","mileage":0,"price":18950,"description":"Recent work in July-August, 2018. 1979 VW Riviera Camper Bus – Mechanically Restored, Partial Costmetic Restoration and Excellent Original condition\n\nA very solid, appreciating classic VW Riviera Camper with originality everywhere. Thousands spent on engine rebuild and other service and restoration.  Full Pop up Camper Top, original, very good condition interior,and low mileage. Believed to be one owner vehicle. A very practical, fun and quickly appreciating classic Riviera Camper. Mileage:  Low\n\nColor:  Original Factory Orange, Partially Repainted with partial original paint in great condition\nEngine:  Professionally rebuilt with minimal miles since rebuild. Recent Tuneup and service 2016 Recents for rebuild\nTrans:  Professionally rebuilt minimal miles since rebuild.  with Receipts\nOptions:  Riveria Camper Package and more\nCondition:  Overal very good to excellent  condition\n\nI can ship the car worldwide at affordable Prices. Email [Email Dealer] or call Jim Giordano at 001-425-985-4259","color":"Original Factory Orange, Partially Repainted with partial original paint in great condition","engine":"Professionally rebuilt with minimal miles since rebuild. Recent Tuneup and service 2016","transmission":"Believed to be professionally rebuilt","options":"Riveria Camper Package and more","item_condition":"Overal very good condition"},{"_id":"d152c5a0-97f0-11eb-b224-ade22a8408a3","created_at":"2021-04-07T22:30:12.000Z","updated_at":"2021-04-07T22:30:36.000Z","thumbnail":"df2262d0-97f0-11eb-b224-ade22a8408a3.jpeg","item_type":"Cars","year":1957,"make":"Devin","model":"MGA","title":" 1957 Devin MGA Special: 1960s Aluminum Buick V8/5spd. In “Kit Form”-Some assembly Required!","url_title":"1957-Devin-MGA-1957-devin-mga-special-1960s-aluminum-buick-v8-5spd-in-kit-form-some-ENyYIgFcQ","sold":false,"stock":"","vin":"","mileage":0,"price":17995,"description":"In Kit Form...Some assembly required.....A great street, track or vintage race car project with much of the hard work completed.  Rare all alloy Buick early 1960s 213 cu in. V8 engine, Datsun 4 or 5sp?, MGA rear end, MGA disk front brakes, new Panasport Alloy racing wheels, custom tube frame struction and partial roll cage build on MGA steel chassis.  $17,950 - Trades Welcome  ","color":"","engine":"Buick 215 Aluminum Block and Head V8","transmission":"Datsun Manual...4spd or 5spd","options":"NOS Devin BOdy parts include door shells, hood, decklid, Drivers Racing Headrest rear cowl, sill panels and more","item_condition":"Project with professional build work"},{"_id":"6b019370-97f1-11eb-b224-ade22a8408a3","created_at":"2021-04-07T22:34:30.000Z","updated_at":"2021-04-07T22:34:36.000Z","thumbnail":"6de15ad0-97f1-11eb-b224-ade22a8408a3.jpeg","item_type":"Cars","year":1958,"make":"Jaguar","model":"XK150","title":" 1958? Jaguar XK150 DHC? Rolling Chassis","url_title":"1958-Jaguar-XK150-1958-jaguar-xk150-dhc-rolling-chassis-ZGDamJ7Pu","sold":false,"stock":"","vin":"","mileage":0,"price":15950,"description":"Partially restored, very solid, rolling chassis with rebuilt 4 wheel disk brakes, rear end, rear axle, later engine and trans, and part of a DHC? rear cowl/inner boot lid, sheet metal panels, side panels, etc. Currently has Jaguar XKE 4.2 engine and trans installed -these are included in sale, but will remove these and lower the price by $2000 if buyer prefers. The chassis and its mechanical components have bee sitting in storage for several years.  We are working on obtaining Jaguar Heritage certificate and other documentation at this time.\nRare, XK150 rebuilt Chassis - ready for XK or custom body\njaguar XK150 3 speed manual Transmission\nJaguar Xk150 Rear End\n4- XK150 Wire wheels with tires\nXk150 4 Wheel Disk Brakes Installed (front calipers removed but included\nNote:  XK rear floorpan and trunk/wheelwell parts shown not included.\nPossible vintage race application -\n$15,950.00","color":"","engine":"4.2 Liter jag XK6 Engine installed","transmission":"None","options":"","item_condition":"Partially restored"},{"_id":"92d95ad0-97f2-11eb-b224-ade22a8408a3","created_at":"2021-04-07T22:42:46.000Z","updated_at":"2022-02-20T22:07:22.000Z","thumbnail":"02200ff0-9299-11ec-b75d-e5528c2959c2.jpeg","item_type":"Cars","year":1962,"make":"Volkswagen","model":"Beetle Speedster Convertible","title":"1962 Volkswagen Beetle Speedster Convertible (1940 Ford Kit) Turnkey, Fun Custom Bug","url_title":"1962-Volkswagen-Beetle-Speedster-Convertible-1962-volkswagen-beetle-speedster-convertible-1940-ford-kit-turnkey-fun-custom-bug-C5t2kHkP3","sold":false,"stock":"","vin":"","mileage":0,"price":14950,"description":"Note: a few new photos after the cars new light grey paint job, but before final assembly...older photos show the car, \"pre-body and paint\" in red oxide primer. 1962  VW Beetle Speedster (partial 1940 Ford Body kit less front end)- Full custom VIN: 5406876 WA Lic # 46238CV \n\nFresh professional repaint in 2021 Porsche Chalk Grey. \nBlack interior is in overallvery good condition.\nConvertible top is high quality black German-style Canvas. High quality VW cabriolet Folding top frame.Chrome wheels with baby moon caps. A great looking custom VW that is ready to go. Please note -windshield with new rubber seal not installed when photos taken.  This is included in price of course. \n\nEngine 1776cc rebuilt high performance engine. Runs well. Good power.\nTrans: Previous owner claims a Freeway Flyer 4 speed trans with highway ratio gears.\n\n*  Additional photos show a 1949 Hebmuiller Cabriolet, which we considered using this car as a base to build a tribute car, Also a photo of a 1940 Ford fiberglass hood and chrome grill usually found with this kit is available new online.\n\n$ 14,950  USD  Will ship worldwide\n\nLocated in Carnation, WA at Giordano''s Vintage Motors. We Buy, Sell, Consign and Trade Sports, Muscle, Collector Cars and Rods, Motorcycles, Parts and collectables. Come visit our indoor showroom or view our inventory online at www.giocars.com. As well as actively buying and trading vehicles, we welcome consigned vehicles, and offer low consignment sales commissions and no consignment fees, putting more money back in your pocket. We are experts at locating and appraising vehicles, and can help value your vehicle for insurance, estate settlement or in preparation for selling. We have hundreds of satisfied customers, and will work hard to earn your trust. You can visit our showroom at 4501 Tolt Avenue, Carnation, WA 98014. Or view our website at: www.giocars.com. You can email us or call Jim at 425-333-5600. We hope to hear from you! VIN posted at dealership.\n\nThe price for this vehicle as equipped does not include charges such as: License, Title, Registration Fees, State or Local Taxes, Finance Charges, Credit Investigation, Optional Credit Insurance, Physical Damage or Liability Insurance, Delivery Fees, or a negotiable $100 Documentary Service Fee. This website and Dealership makes no representations, expressed or implied, to any actual or prospective purchaser or owner of this vehicle as to the existence, ownership, accuracy, description or condition of this vehicle's listed equipment, accessories, price or any warranties. Any and all differences must be addressed prior to the sale of this vehicle.\n\n \n\nPrice: $15,950 obo","color":"Primer Red with black and white custom pinstriping","engine":"Rebuilt VW 1600","transmission":"4spd Manual","options":"Custom Black Canvas Top with Metal frame, and more.","item_condition":"Very Good"},{"_id":"a4c0bfa0-97f1-11eb-b224-ade22a8408a3","created_at":"2021-04-07T22:36:07.000Z","updated_at":"2021-04-07T22:36:18.000Z","thumbnail":"ab138db0-97f1-11eb-b224-ade22a8408a3.jpeg","item_type":"Cars","year":1957,"make":"La Dawrie","model":"Custom Q.T.","title":" 1957 La Dawrie Custom Q.T. – 1957 VW Karmann Ghia Chassis.","url_title":"1957-La-Dawrie-Custom-Q-T-1957-la-dawrie-custom-q-t-1957-vw-karmann-ghia-chassis-lTE7sWMJ0","sold":false,"stock":"","vin":"","mileage":0,"price":14950,"description":"We love the rare and unusual, be it production automobiles, motorcycles, kit cars or home builts. With our 1957 La Dawrie Q.T./Karman Ghia with a ‘50s customized body and unusual hydraulics, rare is hardly the right word. One-off, one of one might be a better description. Note photos show car as  it looks before we sold the car and our customer partly took it apart for professional restoration and updating..See this rare car in our Carnation showroom/\nWe have included a brief history of the La Dawrie custom bodies below. Here are a few choice details about this car. Perhaps most importantly, it runs and drives very well! The warmed over VW engine moves this lightweight car down the road, with good handling and braking. The La Dawrie Q.T. body has been cleverly customized, with a 1955 Packard Clipper the inspiration for the rear tailfins (with actual ’55 Clipper Taillamp lens), and the unique, 1957 Packard Hawk design clearly visible in the nose and even the rear end treatment. I can see a little early Corvette rear end and Devin or Ferrari 250 GTO in the front end. In the true spirit of custom car builders of this era, the car has unique, electric motor actuated front suspension/ride height, hood and rear engine lid, the later utilizing '50s passenger car convertible top motors! The quality of the fiberglass custom work is done to a very high standard, the the La Dawrie body is in excellent condition, with little cracking or flaws. The chassis and drivetrain are tried and true VW Karmann Ghia. The car is titled as a 1957 Karmann Ghia.\n\nThis car was recently purchased by Giordano's Vintage Motors, after comming out of storage since the 1980s. We are discussing the completion of the interior, dash and light paint restoration as needed. This car runs and drives very well, is incredicbly rare, and is for sale.\n\nLa Dawri History: The LaDawri Q.T. Custom & larger, Conquest was designed and built by Les A. Dawes of British Columbia, Canada and is recognized as Canada’s first fiberglass sports car. The Conquest was first shown at the Pacific International Exhibition at Vancouver Canada in 1956 as the Cavalier. Original plans were to create a complete sports car for sale and distribution throughout the United States and Canada. The body itself is fiberglass and was designed to take a wheelbase of 100 to 104 inches and a tread of 56 to 58 inches. This covered Corvettes, Thunderbirds, and the like of the day. However, within a year, the car, family, and company moved to Long Beach California where production began and the car debuted on the front cover of Road &Track in July 1957. From this point forward, the car was known as the “Conquest”. Soon, Dawes expanded both the number of designs available and the sizes of each design\nas well. New models included Quest Q.T., Daytona, Sebring, and Del Mar.","color":"Red/White","engine":"VW Air cooled High Performance 1500","transmission":"4spd Manual","options":"Large amount of new and rebuilt parts included..inquire please","item_condition":"Partly dissasembled for completion of Build/Restoration"},{"_id":"21c99520-09d0-11ed-b226-537e9ffd52df","created_at":"2022-07-22T15:08:24.000Z","updated_at":"2022-07-23T16:22:04.000Z","thumbnail":"3c614a90-09d0-11ed-b226-537e9ffd52df.jpeg","item_type":"Cars","year":1980,"make":"Rover","model":"SD1 / 3500S","title":"Clear WA Title","url_title":"1980-Rover-SD1-3500S-clear-wa-title-ADpXaj-ZP","sold":false,"stock":"80ROVER3500","vin":"","mileage":72280,"price":13995,"description":"Selling our rare, survivor 1980 Rover  DD1 / 3500 with on 72.283 miles. Aluminum Fuel Injected V8 with manual transmission.   Black with upgrades, quality black leather seats.  This car was owned by a local Rover enthusiast, and has been garaged for many years.\nWe have started the car with starting fluid and it appears engine is in good condition. We are not decided to run the somewhat old as thru the fuel injection system or tested or serviced the brake system, and are selling this car at a discounted price taking into consideration the new owner will need to perform service on the car.  The body is very straight and unmolested, and appears to have very little rust.  Desirable factory alloy wheels, and other options. Believed to be the last year this model was imported into the USA. There USA models usually have cloth seats that fell apart after awhile, and these well done leather seats are an upgrade.  Clear WA Title. \n\nLocated in Carnation, WA at Giordano''s Vintage Motors. We Buy, Sell, Consign and Trade Sports, Muscle, Collector Cars and Rods, Motorcycles, Parts and collectables. Come visit our indoor showroom or view our inventory online at www.giocars.com. As well as actively buying and trading vehicles, we welcome consigned vehicles, and offer low consignment sales commissions and no consignment fees, putting more money back in your pocket. We are experts at locating and appraising vehicles, and can help value your vehicle for insurance, estate settlement or in preparation for selling. We have hundreds of satisfied customers, and will work hard to earn your trust. You can visit our showroom at 4501 Tolt Avenue, Carnation, WA 98014. Or view our website at: www.giocars.com. You can email us or call Jim at 425-333-5600. We hope to hear from you! VIN posted at dealership.\n\nThe price for this vehicle as equipped does not include charges such as: License, Title, Registration Fees, State or Local Taxes, Finance Charges, Credit Investigation, Optional Credit Insurance, Physical Damage or Liability Insurance, Delivery Fees, or a negotiable $150 Documentary Service Fee. This website and Dealership makes no representations, expressed or implied, to any actual or prospective purchaser or owner of this vehicle as to the existence, ownership, accuracy, description or condition of this vehicle's listed equipment, accessories, price or any warranties. Any and all differences must be addressed prior to the sale of this vehicle.","color":"Black","engine":"Alum. V8 Fuel Injected","transmission":"Manual","options":"Alloy Factory Wheels, Leather interior and more","item_condition":"Overall good condition comming out of dry storage"},{"_id":"c2c82060-97f1-11eb-b224-ade22a8408a3","created_at":"2021-04-07T22:36:57.000Z","updated_at":"2021-08-15T20:07:41.000Z","thumbnail":"d513f6e0-97f1-11eb-b224-ade22a8408a3.jpeg","item_type":"Motorcycles","year":1966,"make":"Harley Davidson","model":"SOLD FLH Police Special Pan-Shovel","title":"1966 Harley Davidson FLH Police Special Pan-Shovel – Terrific Restoration – Big Price Reduction","url_title":"1966-Harley-Davidson-SOLD-FLH-Police-Special-Pan-Shovel-1966-harley-davidson-flh-police-special-pan-shovel-terrific-restoration-big-vVkywVZFc","sold":true,"stock":"","vin":"","mileage":0,"price":13500,"description":"SOLD!  Comprehensive Professional restoration costing over $16,000 in receipts from Easy Street Cycle in Seattle WA.\nDesirable Electric and Kick Start Pan/Shovel engine.  Professionally build, thousands in new parts and chroming, with desirable Police Special package. Collectable and great riding Bike! All reciepts and photo documentation of restoration. Recent $3000 price reduction May 28th 2017!","color":"Tri Tone Black, Red/White","engine":"1966 FLH Pan Shovel","transmission":"","options":"Many","item_condition":"Excellent"},{"_id":"e13d8530-97f1-11eb-b224-ade22a8408a3","created_at":"2021-04-07T22:37:48.000Z","updated_at":"2022-11-30T02:58:22.000Z","thumbnail":"76f79250-7059-11ed-a21b-7758503cc61a.jpeg","item_type":"Motorcycles","year":1957,"make":"BMW","model":"R50","title":" 1957 BMW R50 Classic Bike with Earles Forks Includes partial, spare engine","url_title":"1957-BMW-R50-1957-bmw-r50-classic-bike-with-earles-forks-includes-partial-spare-bOI-DbOnv","sold":false,"stock":"","vin":"","mileage":0,"price":12995,"description":"1957 BMW R50  with Earls Front forks, and setup for a side car. This classic Airhead BMW has nice black paint and great patina throughout. Engine in the bike had a rod? damage the case, and space,A partial, spare engine in a box is included in the sale. Work needed, but new owner will have most of a new engine as a spare. Original seat included in the sale along with other valuable parts.  Located in Carnation, WA at Giordano''s Vintage Motors. We Buy, Sell, Consign and Trade Sports, Muscle, Collector Cars and Rods, Motorcycles, Parts and collectables. Come visit our indoor showroom or view our inventory online at www.giocars.com. As well as actively buying and trading vehicles, we welcome consigned vehicles, and offer low consignment sales commissions and no consignment fees, putting more money back in your pocket. We are experts at locating and appraising vehicles, and can help value your vehicle for insurance, estate settlement or in preparation for selling. We have hundreds of satisfied customers, and will work hard to earn your trust. You can visit our showroom at 4501 Tolt Avenue, Carnation, WA 98014. Or view our website at: www.giocars.com. You can email us or call Jim at 425-333-5600. We hope to hear from you! VIN posted at dealership.\n\nThe price for this vehicle as equipped does not include charges such as: License, Title, Registration Fees, State or Local Taxes, Finance Charges, Credit Investigation, Optional Credit Insurance, Physical Damage or Liability Insurance, Delivery Fees, or a negotiable $100 Documentary Service Fee. This website and Dealership makes no representations, expressed or implied, to any actual or prospective purchaser or owner of this vehicle as to the existence, ownership, accuracy, description or condition of this vehicle's listed equipment, accessories, price or any warranties. Any and all differences must be addressed prior to the sale of this vehicle.","color":"Black","engine":"2 engines","transmission":"","options":"Spares","item_condition":""},{"_id":"00f9e8f0-97f2-11eb-b224-ade22a8408a3","created_at":"2021-04-07T22:38:42.000Z","updated_at":"2021-04-07T22:38:49.000Z","thumbnail":"04db8ff0-97f2-11eb-b224-ade22a8408a3.jpeg","item_type":"Motorcycles","year":1964,"make":"Triumph","model":"Bonneville","title":" 1964 Triumph Bonneville -750C Competition. Restored by Steve Giblin, European Motorcycles","url_title":"1964-Triumph-Bonneville-1964-triumph-bonneville-750c-competition-restored-by-steve-giblin-european-motorcycles-q43FZHz1P","sold":false,"stock":"","vin":"","mileage":0,"price":12995,"description":"1964 Triumph Bonneville -750C Competition.  Restored by Steve Giblin, European Motorcycles.$12,995","color":"Gold and White. Black Frame","engine":"750 Competition Engine - Restoration by Steve Giblin-European Motorcycles, Redmond WA","transmission":"","options":"","item_condition":""},{"_id":"75213d70-97f0-11eb-b224-ade22a8408a3","created_at":"2021-04-07T22:27:38.000Z","updated_at":"2022-06-13T17:03:34.000Z","thumbnail":"be3b7180-eb3a-11ec-886e-cf7a5e893e4f.jpeg","item_type":"Cars","year":1978,"make":"chevrolet","model":"Camaro Z28","title":"1978 Chevrolet Camaro Z28 T-Top Coupe -Resto In Progess","url_title":"1978-chevrolet-Camaro-Z28-1978-chevrolet-camaro-z28-t-top-coupe-resto-in-progess-TKX68cyRY","sold":false,"stock":"78CAMZ2801","vin":"1Q87L8L593011","mileage":66310,"price":12500,"description":"Rare, '78 Z28 Camaro T-top coupe. Auto/350 V8 with performance parts and probable rebuild sometime in te past? 66,310 indicated mileage believed to be original miles. Very straight, original car comming out of somewhat longterm dry storage. In July 2020 mechanic quickly changed some fuel line, fluids, and filters and the engine runs well and car was test driven. Lots of potential...For an additional cost we can provide this car freshly painted and with Z28 graphics and emblems and new carpeting but with existing seats.\nCurrent Price as shown: $12,500 - Offers and Trades Welcome. Car is available to view and progress photos and video can be made available.\nLocated in Carnation, WA at Giordano''s Vintage Motors. We Buy, Sell, Consign and Trade Sports, Muscle, Collector Cars and Rods, Motorcycles, Parts and collectables. Come visit our indoor showroom or view our inventory online at www.giocars.com. As well as actively buying and trading vehicles, we welcome consigned vehicles, and offer low consignment sales commissions and no consignment fees, putting more money back in your pocket. We are experts at locating and appraising vehicles, and can help value your vehicle for insurance, estate settlement or in preparation for selling. We have hundreds of satisfied customers, and will work hard to earn your trust. You can visit our showroom at 4501 Tolt Avenue, Carnation, WA 98014. Or view our website at: www.giocars.com. You can email us or call Jim at 425-985-4259. We hope to hear from you! VIN posted at dealership.\nThe price for this vehicle as equipped does not include charges such as: License, Title, Registration Fees, State or Local Taxes, Finance Charges, Credit Investigation, Optional Credit Insurance, Physical Damage or Liability Insurance, Delivery Fees, or a negotiable $100 Documentary Service Fee. This website and Dealership makes no representations, expressed or implied, to any actual or prospective purchaser or owner of this vehicle as to the existence, ownership, accuracy, description or condition of this vehicle's listed equipment, accessories, price or any warranties. Any and all differences must be addressed prior to the sale of this vehicle.\n\nPrice: $12,500","color":"Silver","engine":"","transmission":"","options":"","item_condition":""},{"_id":"1f6eb180-97f2-11eb-b224-ade22a8408a3","created_at":"2021-04-07T22:39:33.000Z","updated_at":"2021-04-07T22:42:23.000Z","thumbnail":"83a76e80-97f2-11eb-b224-ade22a8408a3.jpeg","item_type":"cars","year":1973,"make":"Mercedes Benz","model":"450SL Convertible","title":"Rare White Tan 450SL - 2 Tops","url_title":"1973-Mercedes-Benz-450SL-Convertible-rare-white-tan-450sl-2-tops--Xkg49iLS","sold":false,"stock":"73MB450SL01","vin":"","mileage":0,"price":12500,"description":"New to our Inventory. A rare color combination and desirable 1973 chrome bumper 450SL roadster. White factory hardtop and blue canvas softtop. Automatic. Recent updating and service. Some paint flaws and minor cosmetic issue.  Light paint touchup and detailing of the engine comparment would bring this car up to the next level.  Runs and drives very well. An appreicating, affordable and fun to drive classic Benz.  Affordably priced at $12,500. \n\nLocated in Carnation, WA at Giordano''s Vintage Motors. We Buy, Sell, Consign and Trade Sports, Muscle, Collector Cars and Rods, Motorcycles, Parts and collectables. Come visit our indoor showroom or view our inventory online at www.giocars.com. As well as actively buying and trading vehicles, we welcome consigned vehicles, and offer low consignment sales commissions and no consignment fees, putting more money back in your pocket. We are experts at locating and appraising vehicles, and can help value your vehicle for insurance, estate settlement or in preparation for selling. We have hundreds of satisfied customers, and will work hard to earn your trust. You can visit our showroom at 4501 Tolt Avenue, Carnation, WA 98014. Or view our website at: www.giocars.com. You can email us or call Jim at 425-333-5600. We hope to hear from you! VIN posted at dealership.\n\nThe price for this vehicle as equipped does not include charges such as: License, Title, Registration Fees, State or Local Taxes, Finance Charges, Credit Investigation, Optional Credit Insurance, Physical Damage or Liability Insurance, Delivery Fees. This website and Dealership makes no representations, expressed or implied, to any actual or prospective purchaser or owner of this vehicle as to the existence, ownership, accuracy, description or condition of this vehicle's listed equipment, accessories, price or any warranties. Any and all differences must be addressed prior to the sale of this vehicle.","color":"white - tan - 2 tops","engine":"Std 450SL 4.5L v8","transmission":"Automatic","options":"Std 450SL options","item_condition":"Overall good condition "},{"_id":"10e3b390-97f2-11eb-b224-ade22a8408a3","created_at":"2021-04-07T22:39:08.000Z","updated_at":"2021-04-07T22:39:08.000Z","thumbnail":"aacb4e10-85a5-11ea-81dc-1b5846a7964f.jpeg","item_type":"Cars","year":1965,"make":"SOLD Corvair","model":"Corsa 140","title":" 1965 Corvair Corsa 140 -Only Corvair to race in the Carrera Panamericana Road Race in Mexico! Featured in Hemmings 2018","url_title":"1965-SOLD-Corvair-Corsa-140-1965-corvair-corsa-140-only-corvair-to-race-in-the-carrera-o1R6kcVOj","sold":false,"stock":"","vin":"","mileage":0,"price":12500,"description":"Recently SOLD: We are seeking a good condition V8 Converted 65-69 Corvair coupe or convertible","color":"Metallic Red with Black and red interior","engine":"Corsa 140 4 carb engine","transmission":"4spd manual Chevrolet","options":"","item_condition":"Engine Needs Cylinder Head repair -damage to one valve seat, and possibly other work required"},{"_id":"8b673a10-97f2-11eb-b224-ade22a8408a3","created_at":"2021-04-07T22:42:34.000Z","updated_at":"2021-04-07T22:42:46.000Z","thumbnail":"9205b720-97f2-11eb-b224-ade22a8408a3.jpeg","item_type":"Motorcycles","year":1973,"make":"Kawasaki","model":"Z1-R","title":" 1973 Kawasaki Z1-R “Sanctuary – Style”, Custom Performance Build. Matching Engine","url_title":"1973-Kawasaki-Z1-R-1973-kawasaki-z1-r-sanctuary-style-custom-performance-build-matching-engine-rb_yhJQug","sold":false,"stock":"","vin":"","mileage":0,"price":10995,"description":"1973 Kawasak Z1 (KZ900) Custom Build \" Sanctuary-style\" restoration Mod. Rare, Factory 1973 Z1 with matching rebuilt engine.  Black Cherry pearl paint. Frame has been restored and widened for rear chain clearance. Rake adjusted for Kawaska 636 front forks with custom built triple clamps. Stock bodywork, guages, headlight tank, seat and tail/fender.  Features of this Custom Build include:  \nGPZ Alum. swing arm with ZX-7 rear wheels with disk brake. Kawasaki Lawson replica rear shocks. Custom mounted foot controls. Latel model switches and controls. Alum. Fatty handlebars. \nEngine:  1015cc Piston Kit. Clean-up porting job with new stainless Valves. Powder coated cases. New clutch Pcs. Offset front sprocket. HP coils/ignition. Other build specs: Custon built 4-2-2 Exhaust with repackable under swing arm muffler assembly. Twin S/S upswept exhaust outlets. 636 Kawa calipers and rotors. Custom fit taillight and rear mud guard. Under-seat key system and more. Fast, and professionally built to a high standard. ","color":"Black Cherry Metallic","engine":"1015cc","transmission":"","options":"See description","item_condition":"Excellent"},{"_id":"d0bd7890-97f2-11eb-b224-ade22a8408a3","created_at":"2021-04-07T22:44:30.000Z","updated_at":"2021-04-07T22:44:48.000Z","thumbnail":"dafac740-97f2-11eb-b224-ade22a8408a3.jpeg","item_type":"Motorcycles","year":2004,"make":"Custom Chopper","model":"","title":"2004 Custom Chopper: Great build Quality…and a Fine Looking and Riding Softail.","url_title":"2004-Custom-Chopper--2004-custom-chopper-great-build-quality-and-a-fine-looking-and-riding-softail-rEa3JFjZb","sold":false,"stock":"","vin":"","mileage":0,"price":10950,"description":"This Bike has a great stance and cool look, and it's a turnkey chopper. Featuring a $32-35,000 build cost according to previous owner and title using high quality components including Merc Engine cases, Edelbrock Heads, Prime Belt Drives belt primary with chain secondary, S&S carbs, Body Cottington Custom wheels with matched brake disk rotors, and M/P califpers, 2 to 1 customer wrapped headers/pipes. Great looking Purple custom paint, flame-tooled leather solor seat with new leather side bag. Avon RoadRunner 90/90 HR21 front tires with Ditzler Marathon rear 20/50 ZR18 rear tires\n\n$ 10,950 - Trades Welcome.","color":"","engine":"","transmission":"","options":"","item_condition":""},{"_id":"e47402a0-97f2-11eb-b224-ade22a8408a3","created_at":"2021-04-07T22:45:03.000Z","updated_at":"2021-04-07T22:45:17.000Z","thumbnail":"ea2d01b0-97f2-11eb-b224-ade22a8408a3.jpeg","item_type":"Cars","year":1970,"make":"Jeep","model":"CJ5","title":"1970 Jeep CJ5 Std 4WD","url_title":"1970-Jeep-CJ5-1970-jeep-cj5-std-4wd-oELJhzCCS","sold":false,"stock":"70JEEPOCJ501","vin":"","mileage":0,"price":9997,"description":"1970 Jeep CJ5 Std 4WD  \nFresh out of recent dry storage is our 1970 Jeep Cj5. Believed to be original, V6 engine with 4spd manual and std 4WD components in working order. The vehicle is still in storage and we have not driven of taken a video of it. Sale includes new, reproduction front floor pan repair panels, and other parts shown in photos. Yes, there is some outer body rust, but very repairable. More photos and video in late April or early May if not sold.\nLocated in Carnation, WA at Giordano''s Vintage Motors. We Buy, Sell, Consign and Trade Sports, Muscle, Collector Cars and Rods, Motorcycles, Parts and collectables. Come visit our indoor showroom or view our inventory online at www.giocars.com. As well as actively buying and trading vehicles, we welcome consigned vehicles, and offer low consignment sales commissions and no consignment fees, putting more money back in your pocket. We are experts at locating and appraising vehicles, and can help value your vehicle for insurance, estate settlement or in preparation for selling. We have hundreds of satisfied customers, and will work hard to earn your trust. You can visit our showroom at 4501 Tolt Avenue, Carnation, WA 98014. Or view our website at: www.giocars.com. You can email us or call Jim at 425-985-4259. We hope to hear from you! VIN posted at dealership.\nThe price for this vehicle as equipped does not include charges such as: License, Title, Registration Fees, State or Local Taxes, Finance Charges, Credit Investigation, Optional Credit Insurance, Physical Damage or Liability Insurance, Delivery Fees, or a negotiable $100 Documentary Service Fee. This website and Dealership makes no representations, expressed or implied, to any actual or prospective purchaser or owner of this vehicle as to the existence, ownership, accuracy, description or condition of this vehicle's listed equipment, accessories, price or any warranties. Any and all differences must be addressed prior to the sale of this vehicle.\n\nPrice: $9,995\n","color":"","engine":"6 Cylinder","transmission":"4 spd Manual ","options":"","item_condition":"Good"},{"_id":"e60be8b0-dc4f-11ec-bd11-3d227e7d8669","created_at":"2022-05-25T17:27:06.000Z","updated_at":"2022-06-13T02:24:34.000Z","thumbnail":"69237ab0-dc50-11ec-bd11-3d227e7d8669.jpeg","item_type":"Cars","year":1988,"make":"chevrolet","model":"Corvette","title":"1988 Chevrolet Corvette Almost All Available Options","url_title":"1988-chevrolet-Corvette-1988-chevrolet-corvette-almost-all-available-options-qcdGi5dkm","sold":false,"stock":"88CORVC401","vin":"1G1YY2185J5117047","mileage":110464,"price":9995,"description":"1988 Corvette Coupe.  Very well maintained, orginal car in overall very good condition. Terrific body and paint, almost every factory available option (see option list below) and ready to drive and enjoy!  The rare, Leather Factory driver and passenger  6 way power Sports seats, with wear damage to leather covers of drivers seats and leather console cover plastic lid needs work.  We are presently looking at options for the buyer to reupholster the drivers seat.  Performance Rear axel, L98 Performance V8 and good shifting, quiet, automatic transmission. Also Z52 Sport Handling Package, Dual removable roof panels, Bose High end stereo with Bose Speaker system, Styled aluminum wheels, 17 x 9.5\"  with performance radials tires, and much more.  Air Conditioning updated to R134.  Recent, comprehensive brake service and coolant flust in 12/2021.  This is very good looking and driving C4 Coupe!   \n\n1988 Corvette C4 Coupe Factory Installed Options  and prices below  \nCode Option Description Production MFR List Price \n\nAC1 Power 6-way adj. passenger sport seat 8,332 $ 615 \n\nAC3 Power 6-way adj. driver sport seat 22,084 240 \n\nAQ9 Sport seats ‑ leather* 12,724 1,025 \n* Special sports seats with inflatable lumbar support and power adjustable bolsters \n\nBGR Bowling Green assembly B3W Advance price sheet \n\nB4P Radiator cooling boost fan 19,035 75 \n\nCC3 Transparent roof panel \n\nCF7 Non‑transparent roof panel \n\nC2L Dual removable roof panels 5,091 915 \n\nC49 Electric rear window defogger \n\nC68 Automatic electronic A/C 19,372 150 \n\nDL8 Twin remote heated outside mirrors 6,582 35 \n\nD3X Speedometer driven gear 25513049 green \n\nD74 Illuminated driver vanity mirror 14,249 58 \n\nD98 Speedometer sensor 25007308 \n\nE5Z Delete speedometer adaptor \n\nFG3 Delco-Bilstein gas shock absorbers 18.437 189 \n\nG44 Rear axle 3.07 ratio \n\nG92 Rear axle performance ratio 4,397    22 \n\nKC4 Engine oil cooler 18,887 110 \n\nK68 105 amp generator \n\nL98 Tuned port injection 5.7 L engine \n\nMD8 Automatic 4‑speed transmission MX0 Automatic transmission \n\nQA1 Styled aluminum wheels, 17 x 9.5\" \n\nUQ4 Delco Bose four speaker system \n\nUU8 Delco Bose AM/FM stereo radio/cass. 20.304 773 \n\nV01 Heavy duty radiator 19,271 40 \n\nV73 Vehicle statement certification, USA \n\nXAU Front tire P275/40 ZR17 \n\nZ52 Sport handling package 16,017 970 \n* HD shocks, extra stiffening braces in the front part of the frame, an oil cooler,  \nauxiliary engine fan, HD radiator, larger front sway bar, and quicker 13:1 steering  \n\nZ6A Rear window and side mirror defoggers 14,648 165 \n\n1AZ Modification stock order or order sold \n\n24S Blue tint roof panel 8,332 615 \n\n4OU Speedway White exterior Paint: Base Coat/Clear Coat WA-L8554    3,620 made \n\n90I (901?) Grey Interior trim 902 Grey Leather Interior 909 Grey Safety Belts \n\nMisc codes found on Data Tag 1YY07   U8554 902 Total 1988 Production: 22,749  \n\nTotal Estimated cost in 1988 of above listed Options: $ 5,997   Base Corvette Coupe w/350 cu.in. V8 and Auto Trans.  $ 29,489 \n\nTotal est. cost of base Coupe Plus listed options $ 35,486 \n\n \n\nLocated in Carnation, WA at Giordano''s Vintage Motors. We Buy, Sell, Consign and Trade Sports, Muscle, Collector Cars and Rods, Motorcycles, Parts and collectables. Come visit our indoor showroom or view our inventory online at www.giocars.com. As well as actively buying and trading vehicles, we welcome consigned vehicles, and offer low consignment sales commissions and no consignment fees, putting more money back in your pocket. We are experts at locating and appraising vehicles, and can help value your vehicle for insurance, estate settlement or in preparation for selling. We have hundreds of satisfied customers, and will work hard to earn your trust. You can visit our showroom at 4501 Tolt Avenue, Carnation, WA 98014. Or view our website at: www.giocars.com. You can email us or call Jim at 425-333-5600. We hope to hear from you! VIN posted at dealership.\n\nThe price for this vehicle as equipped does not include charges such as: License, Title, Registration Fees, State or Local Taxes, Finance Charges, Credit Investigation, Optional Credit Insurance, Physical Damage or Liability Insurance, Delivery Fees, or a negotiable $150 Documentary Service Fee. This website and Dealership makes no representations, expressed or implied, to any actual or prospective purchaser or owner of this vehicle as to the existence, ownership, accuracy, description or condition of this vehicle's listed equipment, accessories, price or any warranties. Any and all differences must be addressed prior to the sale of this vehicle.","color":"White","engine":"v8","transmission":"Auto","options":"See list in description please","item_condition":"very good"},{"_id":"a9404cf0-97f4-11eb-b224-ade22a8408a3","created_at":"2021-04-07T22:57:43.000Z","updated_at":"2021-04-07T22:58:14.000Z","thumbnail":"bb4110b0-97f4-11eb-b224-ade22a8408a3.jpeg","item_type":"Cars","year":1965,"make":"Jaguar","model":"3.8S Saloon","title":" 1965 Jaguar 3.8S Saloon. Superb Body. Matching 3.8 liter Twincam Overdrive 4spd manual trans.","url_title":"1965-Jaguar-3-8S-Saloon-1965-jaguar-3-8s-saloon-superb-body-matching-3-8-liter-twincam-overdrive-tyXDHVIeF","sold":false,"stock":"","vin":"","mileage":0,"price":7995,"description":"1965 RHD Jaguar 3.8S Saloon. Superb Body. Matching 3.8 liter Twincam Overdrive 4spd manual transmission. Shortblock engine professionally rebuild. Cylinder Head machined and ready to install. Buyer will need to complete assembly and installation of engine. Needs completion. Very good condition wood, nice grey leather interior, carpet and interior. Paint is overall good condition. ","color":"Blue/Blue Grey Leather Interior","engine":"3.8 Matching Engine. Partially Rebuilt.","transmission":"4spd Overdrive manual trans","options":"Radio, Chrome Wires wheels and more","item_condition":"Very good original condition"},{"_id":"9aa9b640-97f4-11eb-b224-ade22a8408a3","created_at":"2021-04-07T22:57:18.000Z","updated_at":"2021-04-07T22:57:25.000Z","thumbnail":"9e1d8040-97f4-11eb-b224-ade22a8408a3.jpeg","item_type":"Cars","year":1960,"make":"Triumph","model":"TR3","title":" 1960 Triumph TR3 Project Car. Dry Climate Survivor ready to restore or “Highly Patina-ed” Driver","url_title":"1960-Triumph-TR3-1960-triumph-tr3-project-car-dry-climate-survivor-ready-to-restore-ayhcb2YVp","sold":false,"stock":"","vin":"","mileage":0,"price":7995,"description":"A solid and more or less complete Project TR3 Barn Find comming out of long term dry storage.\nWA Title in hand.  Recent mechanical service, engine now running well.","color":"Currently White. Originally Primrose Yellow?","engine":"Believed to be original 4cyl triumph","transmission":"T4 Manual","options":"Side curtains, top etc","item_condition":"Looks all there, but cosmetically challenged?"},{"_id":"89c6db80-fe03-11eb-b16e-9fd1a9a16a6b","created_at":"2021-08-15T20:01:11.000Z","updated_at":"2021-08-22T02:38:56.000Z","thumbnail":"1511ec00-02f2-11ec-9c87-db10660faf75.jpeg","item_type":"Motorcycles","year":2000,"make":"Harley Davidson","model":"FLSTF \" Fat Boy\". 88","title":"Clear WA Title","url_title":"2000-Harley-Davidson-FLSTF-Fat-Boy-88-clear-wa-title-yY4Oegx4A","sold":false,"stock":"","vin":"1HD1BMY19YY019516","mileage":34938,"price":7995,"description":"Just In! Exceptional condition and updated and customized 2000 HD FLSTF \" Fat Boy\". 88cu.in., CID Air Cooled V-Twin 5 Speed Manual transmission. The motor is mated to a 5 speed transmission that shifts smooth. The bike has tons of custom touches and everything appears in excellent condition. Terrific cosmetic condition - paint, chrome and trim are in excellent condition. \n\nView startup and walk around video on YouTube at:   https://youtu.be/DH5uHXz1-MQ\n\nOriginal parts taken off this bike when customized are included in the sale, including factory wheels, bags for bike - backpack new saddle bag, Inferno Shifter pegs for both sides - old pegs in package, new A cams kit (old cam in box) 25937-99b, original headlights - NEW installed. M6 Chain Tensioner. Motorcycle oil, Hot wires - new spark plug wires, Photos of some of these parts show here in ad.  View short video walk thru of included parts at:  https://youtu.be/PNtquFM-5UY\n\nThis vehicle is consigned to Giordano's Vintage Motors, who is acting as a Sales Agent. The Company is not making any representations as to the condition and/or the value of this vehicle. Giordano's Vintage Motors has not checked the condition (mechanical or structural), mileage or authenticity of this vehicle and is relying on the information provided by the seller. The company is not responsible for omissions and/or errors in advertising this vehicle and the buyer shall hold the Company harmless from all future claims arising from any representations made by the Seller. All vehicles are sold on an AS-IS, WHERE-IS basis. This bike is presently located in Battle Ground, WA, but can be made available to be brought to our showroom located in Carnation, WA . We Buy, Sell, Consign and Trade Sports, Muscle, Collector Cars and Rods, Motorcycles, Parts and collectables. Come visit our indoor showroom or view our inventory online at www.giocars.com. As well as actively buying and trading vehicles, we welcome consigned vehicles, and offer low consignment sales commissions and no consignment fees, putting more money back in your pocket. We are experts at locating and appraising vehicles, and can help value your vehicle for insurance, estate settlement or in preparation for selling. We have hundreds of satisfied customers, and will work hard to earn your trust. You can visit our showroom at 4501 Tolt Avenue, Carnation, WA 98014. Or view our website at: www.giocars.com. You can email us or call or text Jim at 425-985-4259. We hope to hear from you! VIN posted at dealership. The price for this vehicle as equipped does not include charges such as: License, Title, Registration Fees, State or Local Taxes, Finance Charges, Credit Investigation, Optional Credit Insurance, Physical Damage or Liability Insurance, Delivery Fees, or a negotiable $100 Documentary Service Fee. This website and Dealership makes no representations, expressed or implied, to any actual or prospective purchaser or owner of this vehicle as to the existence, ownership, accuracy, description or condition of this vehicle's listed equipment, accessories, price or any warranties. Any and all differences must be addressed prior to the sale of this vehicle.  $ 8,995 includes all take-off and spare parts listed","color":"Burgundy two tone metallic","engine":"88cu.in., CID Air Cooled V-Twin ","transmission":"5 Speed Manual transmission","options":"Many Original Takeoff Factory parts and other spares listed in description View short video walk thru of included parts at:  https://youtu.be/PNtquFM-5UY","item_condition":"Excellent"},{"_id":"60642a40-fad4-11eb-a3b4-179c4fa6e7a8","created_at":"2021-08-11T18:46:02.000Z","updated_at":"2021-08-19T03:15:02.000Z","thumbnail":"f7a9e750-fad4-11eb-a3b4-179c4fa6e7a8.jpeg","item_type":"Motorcycles","year":2000,"make":"Harley Davidson","model":"FLSTF Fat Boy 88 5 spd","title":"Clear WA Title","url_title":"2000-Harley-Davidson-FLSTF-Fat-Boy-88-5-spd-clear-wa-title-OSMx3ceLC","sold":false,"stock":"HDFLFB01","vin":"1HD1BMY19YY019516","mileage":34938,"price":7995,"description":"Just In!  Exceptional condition and updated and customized 2000 HD FLSTF \" Fat Boy\". 88cu.in.,  CID Air Cooled V-Twin 5 Speed Manual transmission. The motor is mated to a 5 speed transmission that shifts smooth. The bike has tons of custom touches and everything appears in excellent condition.  Terrific cosmetic condition - paint, chrome and trim are in excellent condition.  Original parts taken off this bike when customized are included in the sale, including factory wheels, saddlebags and top bag, and more.  A photo and description of these parts available soon.  Ready to Ride.   \n\nThis vehicle is consigned to Giordano's Vintage Motors, who is acting as a Sales Agent. The Company is not making any representations as to the condition and/or the value of this vehicle. Giordano's Vintage Motors has not checked the condition (mechanical or structural), mileage or authenticity of this vehicle and is relying on the information provided by the seller. The company is not responsible for omissions and/or errors in advertising this vehicle and the buyer shall hold the Company harmless from all future claims arising from any representations made by the Seller. All vehicles are sold on an AS-IS, WHERE-IS basis.  \n \nThis bike is presently located in Battle Ground, WA, but can be made available to be brought to our showroom located in Carnation, WA . We Buy, Sell, Consign and Trade Sports, Muscle, Collector Cars and Rods, Motorcycles, Parts and collectables. Come visit our indoor showroom or view our inventory online at www.giocars.com. As well as actively buying and trading vehicles, we welcome consigned vehicles, and offer low consignment sales commissions and no consignment fees, putting more money back in your pocket. We are experts at locating and appraising vehicles, and can help value your vehicle for insurance, estate settlement or in preparation for selling. We have hundreds of satisfied customers, and will work hard to earn your trust. You can visit our showroom at 4501 Tolt Avenue, Carnation, WA 98014. Or view our website at: www.giocars.com. You can email us or call or text Jim at 425-985-4259. We hope to hear from you! VIN posted at dealership.\n\nThe price for this vehicle as equipped does not include charges such as: License, Title, Registration Fees, State or Local Taxes, Finance Charges, Credit Investigation, Optional Credit Insurance, Physical Damage or Liability Insurance, Delivery Fees, or a negotiable $100 Documentary Service Fee. This website and Dealership makes no representations, expressed or implied, to any actual or prospective purchaser or owner of this vehicle as to the existence, ownership, accuracy, description or condition of this vehicle's listed equipment, accessories, price or any warranties. Any and all differences must be addressed prior to the sale of this vehicle.","color":"Two tone Burgundy and red. ","engine":"Original good running engine","transmission":"5 speed manual","options":"Many options installed on bike","item_condition":"Excellent"},{"_id":"fe8f9930-fb19-11eb-a3b4-179c4fa6e7a8","created_at":"2021-08-12T03:04:22.000Z","updated_at":"2021-08-12T03:25:51.000Z","thumbnail":"f7f55a80-fb1c-11eb-a3b4-179c4fa6e7a8.jpeg","item_type":"Cars","year":1956,"make":"Ford","model":"F100 Custom Pickup","title":"","url_title":"1956-Ford-F100-Custom-Pickup--osTLUUUUt","sold":false,"stock":"","vin":"17A94173095","mileage":0,"price":6500,"description":"New to market is this classic, '56 F100 Project Pickup/mild street rod build started, including good quality metalwork/bodywork on the very straight and non-rusted, cab, doors etc. Cab is sitting on frame, no engine included in this project, but Ford automatic trans is included.  Was maroon, now cab and doors in yellow primer. Fenders, hood, front grill and other body parts off the car but included in sale.  Period \"mag\" wheels.  Included in sale are probably $2000 in new parts - mainly a Mustang II style front suspension and disk brake conversion kit (with all new parts included to upgrade to Mustang LL front suspension --new, HD steel \"saddle\",upper and lower tubular A-arms, coil springs and tubular shocks, new steering rack and disk brake brake conversion. - New in boxes included in sale. Boxes of used, take off parts come with this project. Our inspection indicates this is a solid truck..Not a heavily rusted or collision damage money pit.  Lost Title. Sold on Notorized Bill of Sale.  WA state patrol assigned VIN tag riveted to the chassis.  This is an offical vin tag that should allow a title to be obtained, possible with an inspection by State Patrol, etc.  A sought after year F100 with most of the important parts in good conidtion. Reupholstered and never installed grey cloth bench seat .  This vehicle is presently at the residence of the owner, but our plan is to deliver the Rolling truck and all parts and store in Dealership Warehouse or off site storage facility in Carnation WA, about 50 minutes from Seattle WA and 30 minutes from Bellevue or Redmond WA.   \n\nThis vehicle is \"For Sale by Owner,\" located at owner's residence in Battle Ground WA. Jim Giordano, Owner of Giordano's Vintage Motors is acting only as a Sales Agent. The Company is not making any representations as to the condition and/or the value of this vehicle. Giordano's Vintage Motors has not checked the condition (mechanical or structural), mileage or authenticity of this vehicle and is relying on the information provided by the seller. The company is not responsible for omissions and/or errors in advertising this vehicle and the buyer shall hold the Company harmless from all future claims arising from any representations made by the Seller. All vehicles are sold on an AS-IS, WHERE-IS basis. This vehicle is not consigned or located at GVM's dealership. It is located at the residence of the Seller in Battle Ground. Sold F.O.B. Battle Ground WA. Vehicle is available for inspection at GVM or other location in Battle Ground convenient to buyer and seller. Purchase Order will be between buyer and seller. Seller will send the title by tracked, FEDX or UPS tracked delivery to buyer upon full payment and clearing of all funds from Bank Wire transfer from buyer to Seller's bank account. About Giordano''s Vintage Motors. We Buy, Sell, Consign and Trade Sports, Muscle, Collector Cars and Rods, Motorcycles, Parts and collectables. Come visit our indoor showroom or view our inventory online at www.giocars.com. As well as actively buying and trading vehicles, we welcome consigned vehicles, and offer low consignment sales commissions and no consignment fees, putting more money back in your pocket. We are experts at locating and appraising vehicles, and can help value your vehicle for insurance, estate settlement or in preparation for selling. We have hundreds of satisfied customers, and will work hard to earn your trust. You can visit our showroom at 4501 Tolt Avenue, Carnation, WA 98014. Or view our website at: www.giocars.com. You can email us or call Jim at 425-333-5600. We hope to hear from you! VIN posted at dealership. The price for this vehicle as equipped does not include charges such as: License, Title, Registration Fees, State or Local Taxes, Finance Charges, Credit Investigation, Optional Credit Insurance, Physical Damage or Liability Insurance, Delivery Fees, or a negotiable $150 Documentary Service Fee. This website and Dealership makes no representations, expressed or implied, to any actual or prospective purchaser or owner of this vehicle as to the existence, ownership, accuracy, description or condition of this vehicle's listed equipment, accessories, price or any warranties. Any and all differences must be addressed prior to the sale of this vehicle.","color":"Maroon","engine":"No Engine","transmission":"Ford Automatic","options":"See description above","item_condition":"Solid Truck Project"},{"_id":"5ef29d60-0387-11ed-beaa-13814d14c059","created_at":"2022-07-14T15:12:26.000Z","updated_at":"2022-07-17T05:04:40.000Z","thumbnail":"611dec60-0388-11ed-beaa-13814d14c059.jpeg","item_type":"Cars","year":1972,"make":"MG","model":"MGB","title":"WA Title","url_title":"1972-MG-MGB-wa-title-JVVUksasG","sold":false,"stock":"","vin":"","mileage":1,"price":5995,"description":"This is a very solid, well maintained 1972 MGB convertible.  The seller has owned MGBs for over 40 years, and this has been his summer \"driver\" for many years but has decided to put the funds of the sale of his well-loved MGB into an electric, riding lawn mower to mow his quite large yard!  Here is his brief comments on his car.  \"I bought this MGB in 2001 and flew to Witchita Kansas to drive it to Seattle (which I did after a 2 days of waiting for parts in Cheyenne Wyoming.  For the next 10+ years, it was my daily driver. It was years after I bought it that i checked and realized the VIN did not match the title, so there's that :(     It has been an incredibly faithful car and we have had great times together. Most recently I had the carburetor rebuilt. It has consistently started, even after a few months hiding in the garage for the winter. Currently it as some noise when it is in second gear.\"  (Note. The seller said in a recent drive the transmission did Not make this noise).   \n\nThis vehicle is consigned to Giordano's Vintage Motors, who is acting as a Sales Agent. The Company is not making any representations as to the condition and/or the value of this vehicle. Giordano's Vintage Motors has not checked the condition (mechanical or structural), mileage or authenticity of this vehicle and is relying on the information provided by the seller. The company is not responsible for omissions and/or errors in advertising this vehicle and the buyer shall hold the Company harmless from all future claims arising from any representations made by the Seller. All vehicles are sold on an AS-IS, WHERE-IS basis. This privately owner vehicle has a clear, WA title and is ready to view by appointment in Rentorn, WA, about 25 minutes from Sea Tac International Airport.  If needed, it can be made available to be brought to our showroom located in Carnation, WA . We Buy, Sell, Consign and Trade Sports, Muscle, Collector Cars and Rods, Motorcycles, Parts and collectables. Come visit our indoor showroom or view our inventory online at www.giocars.com. As well as actively buying and trading vehicles, we welcome consigned vehicles, and offer low consignment sales commissions and no consignment fees, putting more money back in your pocket. We are experts at locating and appraising vehicles, and can help value your vehicle for insurance, estate settlement or in preparation for selling. We have hundreds of satisfied customers, and will work hard to earn your trust. You can visit our showroom at 4501 Tolt Avenue, Carnation, WA 98014. Or view our website at: www.giocars.com. You can email us or call or text Jim at 425-985-4259. We hope to hear from you! VIN posted at dealership. The price for this vehicle as equipped does not include charges such as: License, Title, Registration Fees, State or Local Taxes, Finance Charges, Credit Investigation, Optional Credit Insurance, Physical Damage or Liability Insurance, Delivery Fees, or a negotiable $100 Documentary Service Fee. This website and Dealership makes no representations, expressed or implied, to any actual or prospective purchaser or owner of this vehicle as to the existence, ownership, accuracy, description or condition of this vehicle's listed equipment, accessories, price or any warranties. Any and all differences must be addressed prior to the sale of this vehicle.","color":"Red","engine":"4 cyl","transmission":"4 spd manual ","options":"","item_condition":"Overall good condition with careful maintenance and garage stored. "},{"_id":"5e4a6e50-97f5-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:02:47.000Z","updated_at":"2021-04-07T23:03:07.000Z","thumbnail":"69bf0480-97f5-11eb-b224-ade22a8408a3.jpeg","item_type":"Motorcycles","year":1981,"make":"Honda","model":"1100","title":" 1981 Honda CBX 1100 6 Cylinder Stock Parts off Bike, With Touring Equipment","url_title":"1981-Honda-1100-1981-honda-cbx-1100-6-cylinder-stock-parts-off-bike-with-GCNDNVnfR","sold":false,"stock":"81CBX01","vin":"","mileage":0,"price":5995,"description":"1981 Honda CBX 1100. Mainly original with minor upgrades. Includes full touring gear, and not shown but included, the original parts from the stock bike taken off when first purchased when touring gear was installed. Missing front fender and rear seat support.\n\n \n\nAbout this model:\n\nHonda had produced a Honda RC series six-cylinder race bike in the mid-1960s, but the CBX was Honda's first production 6 cylinder road bike. The CBX's advanced DOHC 24-valve inline six-cylinder engine was its outstanding feature; but in other respects the bike was conventional, having telescopic forks, a tubular frame, twin rear shocks and straight handlebars.[4][6]\n\nAlthough bulky, the engine was wide only at the top. The width across the crankshaft was relatively narrow as the CBX had a stacked engine accessory arrangement, whereby the alternator and ignition items were positioned behind the cylinder block. This arrangement produced an acceptable engine width low down and moved critical items out of harm's way in the event of grounding.[6]\n\nJournalist L. J. K. Setright wrote of the CBX's width: \"Don't tell me that its engine is too wide: It is no wider than the legs of a rider, so it adds nothing to the frontal area, and personally I would rather have my legs shielded by a cylinder apiece than exposed to every blow Thanks to Wikipedia for above information","color":"Black","engine":"","transmission":"","options":"","item_condition":"Good"},{"_id":"7e55dc70-97f5-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:03:40.000Z","updated_at":"2022-11-30T02:46:49.000Z","thumbnail":"2e2f7b10-7058-11ed-a21b-7758503cc61a.jpeg","item_type":"Motorcycles","year":1978,"make":"BMW","model":"R80","title":" 1978 BMW R80 – Great Touring or Street Bike with Upgrades","url_title":"1978-BMW-R80-1978-bmw-r80-great-touring-or-street-bike-with-upgrades-FLN4p9SoQ","sold":false,"stock":"","vin":"","mileage":0,"price":5595,"description":"Great Looking BMW R80 that's new to our inventory. Recent Professional service.  Runs and rides great. Good looking black paint with med. blue pin striping. Spare seat.  SOme \"S\" upgrades. Ready to Ride.","color":"","engine":"","transmission":"","options":"","item_condition":""},{"_id":"d223df00-97f5-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:06:01.000Z","updated_at":"2021-04-07T23:07:15.000Z","thumbnail":"fc6bd880-97f5-11eb-b224-ade22a8408a3.jpeg","item_type":"Motorcycles","year":80,"make":"Honda","model":"CB750F  Supersport","title":"Original Low Miles 750/4 Supersport","url_title":"80-Honda-CB750F-Supersport-original-low-miles-750-4-supersport-FRzGRdir8","sold":false,"stock":"807504F","vin":"RC042116678","mileage":12850,"price":3995,"description":"Just In!  Terrfic, original condition low mileage Honda 750/4  Supersport.  Original sliver paint with Red pinstriping.\nHondaLine Factory rack and seatrest. Manual, Toolkit, clear Title, good service history and recent work make this collectable and ready to ride classic a wise choice for the vintage Honda enthusiast.  ","color":"Orig. Silver","engine":"750 4 cylinder original engine","transmission":"Manual","options":"Honda Line Rack, upgraded tires, manual, full cover and more","item_condition":"Very Good original condition "},{"_id":"1aa6cc60-97f6-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:08:03.000Z","updated_at":"2021-04-07T23:08:05.000Z","thumbnail":"1ba74c70-97f6-11eb-b224-ade22a8408a3.jpeg","item_type":"Motorcycles","year":0,"make":"BSA","model":"","title":"1968 BSA Starfire 250 - Matched Pair","url_title":"0-BSA--1968-bsa-starfire-250-matched-pair-AxkrN26BS","sold":false,"stock":"","vin":"","mileage":0,"price":3750,"description":"We are selling a matched pair of 1968 BSA Starfire 250cc Motorcycles in rare, original and unmolested \"garage find\" condition.\nSerial numbers are few digits apart, so built close to the same day/week?  Original and good condition paint, great light patina and ocmming out of dry storage. Will need some fuel system work etc. This was a \"his and hers\" set, and one bike has slightly smaller diameter wheels and tires..other than than nearly identical, very low mileage. Both have lost title, and paperwork consists of Notorized Bill of Sale and @25 year private, storage lien. We can or you can, obtain title for these bikes and we can go through this process for a reasonable fee...WIll sell as a pair for $3875  or separately for $1995 each\n\n\nAn article about this Model:  Retrospective: BSA B25 Starfire 250: 1968-1970\nBy Clement Salvadori - October 22, 2007\n(This Retrospective article was published in the October 2007 issue of Rider.)\n\nSTORY and photography BY CLEMENT SALVADORI\n\nThis little machine was an anomaly when it appeared on the showroom floors in 1968; though it was a rather attractive motorcycle, it was powered by an old-fashioned single-cylinder OHV engine.\n\nBSA had been building 250 singles since 1938, and some dim bulb up in marketing thought there was still a market for a little plodder…if you dressed it up real pretty.\n\nIt was a tough engine, slightly undersquare with a 67mm bore, 70mm stroke, having an aluminum alloy head and barrel, with an iron liner, a one-piece forged crankshaft with two flywheels running to keep the vibration down, and a duplex-chain primary drive to handle all that power going to the four-speed tranny. The factory claimed over 20 horsepower at 8,250 rpm—perhaps at the piston dome, but certainly not at the rear wheel.\n\nBack in the 1950s 250cc and smaller motorcycles abounded all over Europe, providing cheap transportation in an economy that was still struggling to overcome the aftereffects of World War II. But as the world’s finances grew stronger, the utilitarian 250 gave way to the Volkswagen, Fiat 500, Austin A40, and the market for these utilitarian machines virtually vanished.\n\nIn the United States during the Eisenhower years this market never really existed, as it was only schoolboys who bought basic bikes with their earnings from a newspaper route, moving up to an old Ford or Plymouth when they could. Proper motorcycles, like big Harleys and BSA Road Rockets, belonged to the small group of enthusiasts most noted for having grease under their fingernails from all the maintenance and repairs that these bikes required.\n\nIn 1968 quarter-liter bikes were still popular but as sport rather than utility vehicles. Just about every manufacturer had one or two. Lots were two-strokes, like the Montesa Scorpion and Bultaco Metralla singles, or the Yamaha Catalina and Kawasaki Samurai twins, and a few four-stroke singles, like Ducati’s Mark 3 Desmo, Benelli’s Barracuda, Harley’s Aer­macchi 250 with a race-bred pushrod engine, and the rather unexciting British offerings, the Triumph TR25 and BSA Starfire. Those last two were very similar machines, differing only in styling and badges.\n\nSince this was essentially a BSA product, we should take a look at its genesis. That 1938 C10 was a flathead engine with separate gearbox in a rigid frame, and after the war an OHV C11 version soon became available, in either a rigid or a plunger frame. The C12, appearing in 1956, used a swingarm frame. 1959 was the year of big change, with a unitized engine/transmission in the C15 Star. In best British tradition the crankcases were split vertically, which usually meant leaving drops of oil wherever the bike was parked. A 26mm Amal Monobloc carb was fitted.\n\nThe loop frame used a single downtube mating with a pair of tubes cradling the engine. A shrouded fork and shocks, and a nacelle around the headlight, were the antithesis of the sporting image. Years rolled on, sales were lackluster, and BSA decided it had to change the dowdy appearance. And performance. And name. The 1966 C15 Sportsman got the nacelle ripped off the headlight, open springs on the rear shocks, and a racy little hump at the back of the long, flat seat.\nGood, but not good enough. The factory decided to spend some money, and the B25 Starfire appeared on the American market in 1968. A new cylinder barrel was cast, with the pushrod tunnel enclosed behind the newly squared-off fins. (A 441cc version, the B44, was also built, but that is another story.) A bigger 28mm Amal Concentric carburetor was fitted, a “hotter” camshaft, and the compression ratio went up to 10:1. A single set of points (so easy to adjust!) sat inside a little cover on the right side of the engine, and the electrics were 12 volt.\n\nThe very first Starfires to come into this country had the old skinny seven-inch brake drums on both 18-inch wheels, but that was soon changed to a full-width drum on the front. The frame was little changed from the C15, though the fork was improved with a double hydraulic damping system. And the metal covers protecting the sliders had now given way to sporty rubber gaiters! Yes, yes! The shrouding had come off the shock absorbers as well. And the rather dull oblong gas tank became an artfully contrived fiberglass container holding 2.5 gallons of fuel, with glorious sunburst BSA emblems. High test, please, as that compression ratio needed the best. Abbreviated chromed fenders and sculpted side panels and oil tank finished the new look, along with the chrome headlight shell and Smiths speedometer (missing on this one). Very pretty it was, in blue and white.\n\nPut a leg over the saddle, bend down and flip the top bit of the kickstarter out 90 degrees, pull in the clutch and kick through to free the nine clutch plates, open the petcock, tickle the carb, turn on the ignition key in the steering head, and if the battery were up the engine should start in one kick. Maybe two or three if it is cold, because the Concentric does not have a choke. Make sure your right inner thigh does not connect with the cap on the oil tank.\n\nClick down into first, the cush drive in the clutch smoothes the take-up, and away you motor. In-town work is a bit sluggish as the cam does not really function well at under 4,000 rpm. The fork has over five inches of travel, the shocks almost three, but the springs are on the stiff side of plush. If the road is smooth, the ride is comfortable. Now the oil is warm and you are in the country. If you are a sporting person, you might have sprung for the optional tachometer, but if not, the engine will certainly tell you when it is near the 8,000 rpm line. The speed tops out at almost 80 mph in fourth gear; you are exhilarated and consider the $750 well spent.","color":"blue and white","engine":"Original 250CC VSA","transmission":"Manual","options":"","item_condition":"Very good, but not started -comming out of dry storage"},{"_id":"8937f0c0-6de0-11ed-8b0a-23167108da04","created_at":"2022-11-26T23:17:46.000Z","updated_at":"2022-11-26T23:18:19.000Z","thumbnail":"98b1e290-6de0-11ed-8b0a-23167108da04.jpeg","item_type":"Motocycles","year":1980,"make":"Kawasaki","model":"KZ750","title":"Clear WA","url_title":"1980-Kawasaki-KZ750-clear-wa-ES_iyrYN1","sold":false,"stock":"80KZ75001","vin":"KZ7506007007","mileage":14332,"price":2995,"description":"1980 Kawasaki KZ750 LTD in overall very good condition.  Recent professional service including new battery, tuneup, brake and electrical work. This bike has been lightly used in recent years, and has been owned by the same enthusiast owner since new.  Original dealer invoice included with sale along with Service manual.  Very good original Dark Red paint, nice cosmetics...this is a low mileage, solid bike available at an affordable price. The bike may require some carb work as it has been difficult to start recently.  Price reflects this condition.  \n\nLocated in Carnation, WA at Giordano''s Vintage Motors. We Buy, Sell, Consign and Trade Sports, Muscle, Collector Cars and Rods, Motorcycles, Parts and collectables. Come visit our indoor showroom or view our inventory online at www.giocars.com. As well as actively buying and trading vehicles, we welcome consigned vehicles, and offer low consignment sales commissions and no consignment fees, putting more money back in your pocket. We are experts at locating and appraising vehicles, and can help value your vehicle for insurance, estate settlement or in preparation for selling. We have hundreds of satisfied customers, and will work hard to earn your trust. You can visit our showroom at 4501 Tolt Avenue, Carnation, WA 98014. Or view our website at: www.giocars.com. You can email us or call Jim at 425-333-5600. We hope to hear from you! VIN posted at dealership.\n\nThe price for this vehicle as equipped does not include charges such as: License, Title, Registration Fees, State or Local Taxes, Finance Charges, Credit Investigation, Optional Credit Insurance, Physical Damage or Liability Insurance, Delivery Fees, or a negotiable $100 Documentary Service Fee. This website and Dealership makes no representations, expressed or implied, to any actual or prospective purchaser or owner of this vehicle as to the existence, ownership, accuracy, description or condition of this vehicle's listed equipment, accessories, price or any warranties. Any and all differences must be addressed prior to the sale of this vehicle.","color":"","engine":"750cc","transmission":"Manual","options":"See listing ","item_condition":"Good Original condition. "},{"_id":"cad02280-fe0d-11eb-b16e-9fd1a9a16a6b","created_at":"2021-08-15T21:14:35.000Z","updated_at":"2021-08-15T21:23:12.000Z","thumbnail":"57773700-fe0e-11eb-b16e-9fd1a9a16a6b.jpeg","item_type":"Motorcycles","year":1991,"make":"Kawasaki","model":"KLR250","title":"Clear WA Title","url_title":"1991-Kawasaki-KLR250-clear-wa-title-o6QjySlqT","sold":false,"stock":"91KAWAKLR25001","vin":"JKAKLMC19MA033938","mileage":1523,"price":2750,"description":"Selling a very good condition, 1523 original mile,  Kawasaki KRZ250 Dual Sport bike with clear WA title great for off road and road riding. Only 1678 original miles with limited use the last 20 years. Carefully stored and maintained with this family's \"Sister\" bike, a similar, 1990 KL250 with only 1623 miles that we are selling. Starts right up and rides well. Great condition overall, including original paint, plastic parts and graphics. Vinyl bag has tool kit, etc. Clear WA title. Some spares and maintenance items included. Never raced or abused. Hard to find this model in this condition!  This vehicle is consigned to Giordano's Vintage Motors, who is acting as a Sales Agent. The Company is not making any representations as to the condition and/or the value of this vehicle. Giordano's Vintage Motors has not checked the condition (mechanical or structural), mileage or authenticity of this vehicle and is relying on the information provided by the seller. The company is not responsible for omissions and/or errors in advertising this vehicle and the buyer shall hold the Company harmless from all future claims arising from any representations made by the Seller. All vehicles are sold on an AS-IS, WHERE-IS basis. This bike is presently located in Battle Ground, WA, but can be made available to be brought to our showroom located in Carnation, WA . We Buy, Sell, Consign and Trade Sports, Muscle, Collector Cars and Rods, Motorcycles, Parts and collectables. Come visit our indoor showroom or view our inventory online at www.giocars.com. As well as actively buying and trading vehicles, we welcome consigned vehicles, and offer low consignment sales commissions and no consignment fees, putting more money back in your pocket. We are experts at locating and appraising vehicles, and can help value your vehicle for insurance, estate settlement or in preparation for selling. We have hundreds of satisfied customers, and will work hard to earn your trust. You can visit our showroom at 4501 Tolt Avenue, Carnation, WA 98014. Or view our website at: www.giocars.com. You can email us or call or text Jim at 425-985-4259. We hope to hear from you! VIN posted at dealership. The price for this vehicle as equipped does not include charges such as: License, Title, Registration Fees, State or Local Taxes, Finance Charges, Credit Investigation, Optional Credit Insurance, Physical Damage or Liability Insurance, Delivery Fees, or a negotiable $100 Documentary Service Fee. This website and Dealership makes no representations, expressed or implied, to any actual or prospective purchaser or owner of this vehicle as to the existence, ownership, accuracy, description or condition of this vehicle's listed equipment, accessories, price or any warranties. Any and all differences must be addressed prior to the sale of this vehicle.","color":"","engine":"","transmission":"","options":"","item_condition":""},{"_id":"89c60750-6ddd-11ed-8b0a-23167108da04","created_at":"2022-11-26T22:56:18.000Z","updated_at":"2022-11-26T23:12:16.000Z","thumbnail":"d4929690-6ddd-11ed-8b0a-23167108da04.jpeg","item_type":"Motocycles","year":1979,"make":"Honda","model":"CX500 Twin","title":"Clear WA ","url_title":"1979-Honda-CX500-Twin-clear-wa-I3Jy31WCl","sold":false,"stock":"78CX50001","vin":"PC012002079","mileage":20840,"price":2750,"description":"Honda CX 500 in overall very good condition.  Recent professional service including new battery, tuneup, brake and electrical work.  Very good original Dark Maroon paint, nice cosmetics...this is a low mileage, solid bike available at an affordable price. CX500s are appreciating and well known for their smooth, shaft drive, low vibration engine reliable Honda mechanicals.   ","color":"Burgundy","engine":"500cc Twin ","transmission":"Manual","options":"Std CX500 ","item_condition":"Very Good"},{"_id":"240cf4f0-97f6-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:08:18.000Z","updated_at":"2021-04-07T23:08:22.000Z","thumbnail":"254e0070-97f6-11eb-b224-ade22a8408a3.jpeg","item_type":"Motorcycles","year":1965,"make":"BSA","model":"250","title":"1965 BSA 250 Single Flat Tracker Style. Beautiful Bike","url_title":"1965-BSA-250-1965-bsa-250-single-flat-tracker-style-beautiful-bike-FpqE9vMhD","sold":false,"stock":"65BSAC15FTRKR01","vin":"","mileage":0,"price":2595,"description":"1965 BSA 250 Single Flat Tracker Style. Beautiful Bike","color":"Silver and Black","engine":"","transmission":"","options":"Flat Track style. Number Plate, etc","item_condition":"Very Good"},{"_id":"2b127130-97f6-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:08:30.000Z","updated_at":"2021-04-07T23:08:45.000Z","thumbnail":"33c52840-97f6-11eb-b224-ade22a8408a3.jpeg","item_type":"","year":1975,"make":"Vespa","model":"150","title":" 1975 Vespa 150 Super Restoration Started","url_title":"1975-Vespa-150-1975-vespa-150-super-restoration-started-mMwOOycaT","sold":false,"stock":"","vin":"","mileage":0,"price":1750,"description":"1975 Vespa 150 Super. Italian made Vespa. Original Salmon-orange paint. Large chrome rear rack. Includes many restoration parts. Great restoration candidate. Needs assembly and possibly other work. Lost title. $1750.","color":"Salmon Orange","engine":"","transmission":"","options":"","item_condition":""},{"_id":"3f9488a0-97f6-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:09:05.000Z","updated_at":"2021-04-07T23:09:07.000Z","thumbnail":"40c28150-97f6-11eb-b224-ade22a8408a3.jpeg","item_type":"Motorcycles","year":1979,"make":"Honda","model":"CX500C","title":"1979 Honda CX500C","url_title":"1979-Honda-CX500C-1979-honda-cx500c-pOIf_yf-S","sold":false,"stock":"","vin":"PCO12002079","mileage":0,"price":1750,"description":"1979 Honda CX500C.  Maroon Metallic Paint.   VINPCO12002079   This is a desirable and great riding 500 Twin patterned after the Moto Guzzi big twins. Smooth engine and shaft drive. Runs great, but does require front brake work and headlight replacement.  $1750","color":"Maroon Metallic Paint","engine":"Moto Guzzi big twins","transmission":"","options":"","item_condition":""},{"_id":"343a3130-97f6-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:08:46.000Z","updated_at":"2021-04-07T23:09:03.000Z","thumbnail":"3dfe0a20-97f6-11eb-b224-ade22a8408a3.jpeg","item_type":"Cars","year":1980,"make":"Mercedes Benz","model":"300D","title":"300 Diesel sedan features very nice Metallic blue paint with blue interior, very straight, undamaged body","url_title":"1980-Mercedes-Benz-300D-300-diesel-sedan-features-very-nice-metallic-blue-paint-with-blue-interior-LMjFpVITl","sold":false,"stock":"","vin":"","mileage":0,"price":1750,"description":"Our 300 Diesel sedan features very nice Metallic blue paint with blue interior. Very straight, undamaged body. We believe the engine needs some minor work, and we have not driven this car yet.Â Mileage is under 200,000. With the price of gas, these diesels provide comfortable ride,great looks and very good economy and longevity. Only $1,750 Trades welcome.","color":"Metallic blue paint with blue interior.","engine":"","transmission":"","options":"","item_condition":""},{"_id":"413a4960-97f6-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:09:07.000Z","updated_at":"2021-04-07T23:09:10.000Z","thumbnail":"42649890-97f6-11eb-b224-ade22a8408a3.jpeg","item_type":"Motorcycles","year":1961,"make":"Aermacchi","model":"250","title":"1961 Aermacchi 250 Ala Verde serie 1?- Project – Restore stock or vintage race","url_title":"1961-Aermacchi-250-1961-aermacchi-250-ala-verde-serie-1-project-restore-stock-or-2eHq8noFT","sold":false,"stock":"","vin":"","mileage":0,"price":995,"description":"Aermacchi 250 Ala Verde serie 1?back 1961 Please Note:  Title is lost.  Sold as Race, off-road or display.  Titleable bike We have had this Italian Aermacchi in our collection, unrestored exactly as we bought it for many years. VIN decodes as a 1961 250 Ala Verde serie 1 motorcycle, with believed to be original, matching engine, partially dissassembled.  Our bike is painted black, but originally red and white. We have included several photos of restored similar bikes in both stock (street) configuration and vintage race style. Description from an enthusiast website: Air cooled, 246cc, Single, OHV Power: 16.04 HP (11.8 kW) @ 6500 rpm Final drive: Chain Top speed: 91.96 mph Curb weight: 251.3 lbs Category: Classic Tags: Classic bike, Touring Add to garage no owner Add to favesNot faved Write review no review Get embed code Share this page Engine and transmission Switch unit Engine type: 1 cylinders, 4-stroke, Single Displacement: 246 cc (15.03 cubic inches) Bore × stroke: 2.6 inch × 2.83 inch (undersquare - longstroke) Cooling system: Air cooled Power: 16.04 HP (11.8 kW) @ 6500 rpm Throttle: Cable operated Valves Valve train: OHV, variable Valves per cylinder: 2 Fuel and ignition Sparks per cylinder: 1 Fuel supply system: Carburetor Ignition type: mechanically timed Funnel diameter: 0.94 inch Compression: 8.5:1 Engine mounting: Transverse Lubrication system: Wet sump Gear box: Manual 4-speed Clutch: Wet, multiple discs, cable operated Final drive: Chain Starter: Kick-starter Dimensions Physical measures Length: 76.3 inch Width: 30 inch Height: 35.8 inch Wheel base: 52 inch Seat height: 29 inch Weight Curb weight: 251.3 lbs Chassis and suspension Frame type: steel, Backbone frame Front Suspension: Cartridge Brake: Single Drum, Ø7.09 inch Rear Suspension: twin shock, Swingarm Brake: Drum, Ø7.09 inch Other ABS available: No Power-to-weight ratio: 0.10 KW/lbs(9.66 lbs/HP) Top speed: 91.96 mph Fuel capacity: 4.49 gals Number of riders: 2 persons","color":"Original Red & White -now black","engine":"250cc Aermacchi","transmission":"","options":"","item_condition":"Ready to restore"},{"_id":"5cf06720-97f6-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:09:54.000Z","updated_at":"2021-04-07T23:09:56.000Z","thumbnail":"5e088de0-97f6-11eb-b224-ade22a8408a3.jpeg","item_type":"Motorcycles","year":1972,"make":"Honda","model":"CT90","title":"1972 Honda CT90 Dual Range","url_title":"1972-Honda-CT90-1972-honda-ct90-dual-range-p2wKTnWPN","sold":false,"stock":"","vin":"","mileage":0,"price":995,"description":"Restored bike. Red with black detailing. Dual Range transmission. NIce trail 90 for only $995.","color":"","engine":"","transmission":"","options":"","item_condition":""},{"_id":"6a8ce660-97f6-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:10:17.000Z","updated_at":"2021-04-07T23:10:40.000Z","thumbnail":"77506ac0-97f6-11eb-b224-ade22a8408a3.jpeg","item_type":"motorcycles","year":1965,"make":"BSA","model":"C15 Dual Sport Trials MX","title":"Project C15  - Vintage Motorcross , Trials","url_title":"1965-BSA-C15-Dual-Sport-Trials-MX-project-c15-vintage-motorcross-trials-c8jC-Dje2","sold":false,"stock":"65BSAC1501","vin":"","mileage":0,"price":950,"description":"Stock #: 65BSAC15250cc\nCondition: Fair\n\nSeller’s Description:\n1965 BSA C15 250cc for restoration. Low Rust, clean unbent frame. Nice original alloy tank. Engine has some parts removed and others may be missing. Restore to stock, flat tracker, street or dual sport. Lots of potential. No Title. Sold on Bill of Sale.\n\nLocated in Carnation, WA at Giordano''s Vintage Motors. We Buy, Sell, Consign and Trade Sports, Muscle, Collector Cars and Rods, Motorcycles, Parts and collectables. Come visit our indoor showroom or view our inventory online at www.giocars.com. As well as actively buying and trading vehicles, we welcome consigned vehicles, and offer low consignment sales commissions and no consignment fees, putting more money back in your pocket. We are experts at locating and appraising vehicles, and can help value your vehicle for insurance, estate settlement or in preparation for selling. We have hundreds of satisfied customers, and will work hard to earn your trust. You can visit our showroom at 4501 Tolt Avenue, Carnation, WA 98014. Or view our website at: www.giocars.com. You can email us or call Jim at 425-333-5600. We hope to hear from you! VIN posted at dealership.\n\nThe price for this vehicle as equipped does not include charges such as: License, Title, Registration Fees, State or Local Taxes, Finance Charges, Credit Investigation, Optional Credit Insurance, Physical Damage or Liability Insurance, Delivery Fees, or a negotiable $100 Documentary Service Fee. This website and Dealership makes no representations, expressed or implied, to any actual or prospective purchaser or owner of this vehicle as to the existence, ownership, accuracy, description or condition of this vehicle's listed equipment, accessories, price or any warranties. Any and all differences must be addressed prior to the sale of this vehicle.\n\nPrice: Asking $950","color":"","engine":"","transmission":"","options":"","item_condition":""},{"_id":"84faa5a0-97f6-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:11:01.000Z","updated_at":"2021-04-07T23:11:05.000Z","thumbnail":"872797c0-97f6-11eb-b224-ade22a8408a3.jpeg","item_type":"Parts","year":0,"make":"Austin Healey","model":"100/6 BN4","title":"Austin Healey 100/6 BN4 Overdrive Transmission","url_title":"0-Austin-Healey-100-6-BN4-austin-healey-100-6-bn4-overdrive-transmission-plKC15mFQ","sold":false,"stock":"","vin":"","mileage":0,"price":750,"description":"","color":"","engine":"","transmission":"Standard","options":"","item_condition":""},{"_id":"c89d40b0-97f6-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:12:54.000Z","updated_at":"2021-04-07T23:13:01.000Z","thumbnail":"cbdd9ea0-97f6-11eb-b224-ade22a8408a3.jpeg","item_type":"Cars","year":1995,"make":"Porsche","model":"Carrera 2 Coupe-Superb 993","title":" Porsche Carrera 2 Coupe-Superb 993. Dk Blue/Grey 6 spd.","url_title":"1995-Porsche-Carrera-2-Coupe-Superb-993-porsche-carrera-2-coupe-superb-993-dk-blue-grey-6-spd-MwnY5Zwfk","sold":true,"stock":"","vin":"99SS321530","mileage":79810,"price":1,"description":"1995 Carrera 2 Coupe:   SOLD\nI can ship the car worldwide at affordable Prices. Email gio@sprynet.com or call Jim Giordano at 001-425-985-4259","color":"Deep Metallic Blue with grey leather interior","engine":"Carrera 3.6 Liter","transmission":"6 Speed","options":"See description below","item_condition":"Very Good overall condition"},{"_id":"2f92b840-c650-11eb-8a8d-8132ce853d2c","created_at":"2021-06-05T22:48:46.000Z","updated_at":"2021-06-15T01:22:28.000Z","thumbnail":"0171fad0-ca55-11eb-b146-d38522412d4e.jpeg","item_type":"cars","year":1975,"make":"chevrolet","model":"SOLD Caprice Convertible","title":"Clear WA Title","url_title":"1975-chevrolet-SOLD-Caprice-Convertible-clear-wa-title-dHGvo_vAu","sold":false,"stock":"75CAPCLASS01","vin":"1N67U5S1149693","mileage":126285,"price":1,"description":"SOLD","color":"Red ","engine":"","transmission":"Automatic","options":"","item_condition":""},{"_id":"b4af2be0-97f6-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:12:21.000Z","updated_at":"2021-04-07T23:12:29.000Z","thumbnail":"b9265c20-97f6-11eb-b224-ade22a8408a3.jpeg","item_type":"Cars","year":1969,"make":"Chevrolet","model":"Nova","title":"SOLD  1969 Chevy Nova – 427 SS Tribute – Corvette Tri-Power. @500hp 496 cu.in. BBC. Awesome car.","url_title":"1969-Chevrolet-Nova-sold-1969-chevy-nova-427-ss-tribute-corvette-tri-power-eAz4qeve9","sold":true,"stock":"","vin":"6911427","mileage":1,"price":1,"description":"1969 Chevy Nova - SS396 -Recently Sold ","color":"","engine":"","transmission":"See listing details above","options":"See listing above","item_condition":""},{"_id":"88c56940-97f6-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:11:07.000Z","updated_at":"2021-04-07T23:11:13.000Z","thumbnail":"89e46dd0-97f6-11eb-b224-ade22a8408a3.jpeg","item_type":"cars","year":1979,"make":"Volkswagen","model":"Campmobile Camper SOLD ","title":"1979 Volkswagen Campmobile Riviera Camper (like Westphalia)","url_title":"1979-Volkswagen-Campmobile-Camper-SOLD-1979-volkswagen-campmobile-riviera-camper-like-westphalia-jS_Uv0FTx","sold":false,"stock":"79VWCAMP01","vin":"","mileage":0,"price":1,"description":"SOLD  1979 VW Riviera Camper Bus ","color":"Orange with Wood and tan interior","engine":"","transmission":"","options":"See description above","item_condition":""},{"_id":"7bfb2060-97f1-11eb-b224-ade22a8408a3","created_at":"2021-04-07T22:34:58.000Z","updated_at":"2021-05-24T14:39:27.000Z","thumbnail":"86890010-97f1-11eb-b224-ade22a8408a3.jpeg","item_type":"Cars","year":1967,"make":"MGB","model":"Roadster","title":"SOLD 1967 MGB Roadster – 4spd Overdrive. Super Solid, Great Driving car!","url_title":"1967-MGB-Roadster-sold-1967-mgb-roadster-4spd-overdrive-super-solid-great-driving-car-5n1Toj_Wq","sold":true,"stock":"","vin":"","mileage":0,"price":1,"description":"Rare and Desirable1967 MGB Roadster SOLD","color":"MGB Mediium Blue (Mineral Blue?)","engine":"","transmission":"","options":"","item_condition":""},{"_id":"6bb6af70-97ed-11eb-b224-ade22a8408a3","created_at":"2021-04-07T22:05:53.000Z","updated_at":"2021-05-10T01:36:14.000Z","thumbnail":"7c367880-97ed-11eb-b224-ade22a8408a3.jpeg","item_type":"Cars","year":1974,"make":"TVR","model":"2500M /3000M","title":"SOLD","url_title":"1974-TVR-2500M-3000M-sold-maEc2Ebj5","sold":false,"stock":"74TVR01","vin":"2894TM","mileage":6277,"price":1,"description":"SOLD    TVR 2500M LHD Ford 302 V8 T5 5speed Coupe - ","color":"New Metallic Blue Paint","engine":"SOLD","transmission":"Ford 5spd OD Manual","options":"See description","item_condition":"Restoration/Engine Swap in process"},{"_id":"01c4d5e0-97f9-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:28:49.000Z","updated_at":"2021-04-07T23:28:49.000Z","thumbnail":"","item_type":"","year":0,"make":"","model":"","title":"","url_title":"0----yFDKFzrYs","sold":false,"stock":"","vin":"","mileage":0,"price":0,"description":"","color":"","engine":"","transmission":"","options":"","item_condition":""},{"_id":"516b75e0-97f9-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:31:03.000Z","updated_at":"2021-04-07T23:31:30.000Z","thumbnail":"615d7de0-97f9-11eb-b224-ade22a8408a3.jpeg","item_type":"Cars","year":1963,"make":"Ford","model":"Galaxie 500R","title":"1963 ½ Ford Galaxie 500 R code 427 4 spd 2 door Hardtop – Rare Survivor","url_title":"1963-Ford-Galaxie-500R-1963-ford-galaxie-500-r-code-427-4-spd-2-door-gOZU--7gg","sold":true,"stock":"","vin":"","mileage":0,"price":0,"description":"","color":"Rangoon Red","engine":"427","transmission":"4 spd Manual","options":"","item_condition":"Very good overall condition!\n"},{"_id":"165adff0-97f8-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:22:14.000Z","updated_at":"2021-04-07T23:22:33.000Z","thumbnail":"20d07cb0-97f8-11eb-b224-ade22a8408a3.jpeg","item_type":"Parts","year":0,"make":"Jaguar","model":"XKE & XK120-150","title":"Jaguar XKE & XK120-150 Parts","url_title":"0-Jaguar-XKE-and-XK120-150-jaguar-xke-and-xk120-150-parts-oT1wjxq_r","sold":false,"stock":"","vin":"","mileage":0,"price":0,"description":"As Listed on website or Inquire if not listed\n\nOur inventory of E-Type and XK Jaguar parts is now available online.  Below is a selection of our parts. Some parts are located in N. Central Florida, and others at our facility in Carnation WA. We can ship parts worldwide at low cost. Let us know what parts you are looking for if you dont see it listed here-we may be able to located them for you. Brief description of the parts shown in adjoining photos: XKE BONNETS:  Series 1 bonnet, no chrome or bumpers with some damage, but rust free.(see photos) Series 1 Bonnet, (copper colored). Fine condition. Includes sugar scoops, and some trim. $3495 2 Fiberglass XKE Bonnets and Moulds for sale!  1 stock style -$795 and one 1960s \"Shark gilled\" Custom bonnet. $650.  Moulds to manufacture these for sale-inquire. ENGINES: XK140 Complete engine-Was a strong runner:  $1650 XK120 Core Engine. Longblock; $550 XKE: 1976, 4.2 liter engine with 2\" SU carburetors. Engine is complete and turns over. Rare 1.5 series nose with chrome, lights and bumpers. XKE TRANSMISSIONS: 2 + 2 syncro 4 speed transmission, Series 1 XKE OHC/Coupe non- syncro 4 speed transmission. Series 2 automatic transmission with converter. XKE MISC PARTS:  XK: Xk150 Door-offer  XK120 Roadster Door: Exc $750 XKE: Series One bare head-core.   Two XKE steering wheels.  Seven chrome wire wheels ranging from excellent to parts rims. MK7 Head-$175 Parts list available as well as photos of  a 1969 XKE 2+2 coupe  parts.","color":"","engine":"","transmission":"","options":"","item_condition":""},{"_id":"e89a8150-0931-11ec-afa3-3782b7044261","created_at":"2021-08-30T01:30:50.000Z","updated_at":"2021-12-17T03:03:32.000Z","thumbnail":"f2fc20e0-0931-11ec-afa3-3782b7044261.jpeg","item_type":"Cars","year":1957,"make":"chevrolet","model":"SOLD Bel Air Nomad","title":"Clear WA Title","url_title":"1957-chevrolet-SOLD-Bel-Air-Nomad-clear-wa-title-LVCR_bIbB","sold":true,"stock":"SOLD ","vin":"","mileage":0,"price":0,"description":"Seller’s Description:  Sorry recently SOLD:  1957 Chevrolet Bel Air Nomad 2 door station wagon in desirable, Red with correct, red and black Bel Air two tone interior.  ","color":"Red / Red and Black Interior","engine":"V8","transmission":"manual ","options":"","item_condition":""},{"_id":"14b54640-97f8-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:22:12.000Z","updated_at":"2021-04-07T23:22:14.000Z","thumbnail":"15cad4f0-97f8-11eb-b224-ade22a8408a3.jpeg","item_type":"Motorcycles","year":1944,"make":"Excelsior","model":"125","title":"1944 Excelsior 125","url_title":"1944-Excelsior-125-1944-excelsior-125-UOA2tYsZy","sold":false,"stock":"","vin":"","mileage":0,"price":0,"description":"1944 Excelsior 125? Viliers original engine. Green. Springer front forks. Was recently a running bike. Great potential and very rare bike.  We are currently restoring this motorcycle.","color":"Green","engine":"","transmission":"","options":"","item_condition":""},{"_id":"119ac6f0-01e8-11ed-ae19-dbb7cac035e4","created_at":"2022-07-12T13:39:35.000Z","updated_at":"2022-10-16T22:20:19.000Z","thumbnail":"385e2d90-01e8-11ed-ae19-dbb7cac035e4.jpeg","item_type":"Cars","year":1973,"make":"Volkswagen","model":"Karman Ghia Coupe","title":"Clear","url_title":"1973-Volkswagen-Karman-Ghia-Coupe-clear-aXWkQKUMO","sold":false,"stock":"73GHIACPE01","vin":"","mileage":0,"price":0,"description":"New to market.  Our 73 Ghia is a Northern CA native and a true survivor.  The body is straight, with minimal rust present. Believed to have one repaint from new in correct original yellow color. Notably this car has a professional, 5 spd manual transmission  in a 1969 case, 3.08 ring gear displacement.upgrade,  Engine was previously rebult to 1776cc with 90.5 pistons. Engine #  AK35559 believed to be original matching,engine.  Original brown interior. Equiped with set of 4, rare, alloy VW 6 slot \"Turtleback: dealer installed wheels.  Included new in box, complete dk grey carpet kit.  The car is coming out of dry storage.  It runs well direct feeding gas from auxilliary tank into carb, Gas Tank has rust, so should be replaced.  New starter installed in Aug, 2022. This car would be perfect for new owner going through the fuel and brake system and drive and enjoy it, or a great starting point for t a restoration, renewing paint and interior.  Clear WA Title.\n\nLocated in Carnation, WA at Giordano''s Vintage Motors. We Buy, Sell, Consign and Trade Sports, Muscle, Collector Cars and Rods, Motorcycles, Parts and collectables. Come visit our indoor showroom or view our inventory online at www.giocars.com. As well as actively buying and trading vehicles, we welcome consigned vehicles, and offer low consignment sales commissions and no consignment fees, putting more money back in your pocket. We are experts at locating and appraising vehicles, and can help value your vehicle for insurance, estate settlement or in preparation for selling. We have hundreds of satisfied customers, and will work hard to earn your trust. You can visit our showroom at 4501 Tolt Avenue, Carnation, WA 98014. Or view our website at: www.giocars.com. You can email us or call Jim at 425-333-5600. We hope to hear from you! VIN posted at dealership.\nThe price for this vehicle as equipped does not include charges such as: License, Title, Registration Fees, State or Local Taxes, Finance Charges, Credit Investigation, Optional Credit Insurance, Physical Damage or Liability Insurance, Delivery Fees, or a negotiable $150 Documentary Service Fee. This website and Dealership makes no representations, expressed or implied, to any actual or prospective purchaser or owner of this vehicle as to the existence, ownership, accuracy, description or condition of this vehicle's listed equipment, accessories, price or any warranties. Any and all differences must be addressed prior to the sale of this vehicle.","color":"Yellow","engine":"4 cyl 1776cc  Rebuilt many years ago","transmission":"Rare 5 spd custom pro built transmission ","options":"Dealer installed rare, Superior Industries Turtleback six slot alloy wheels  15 x 4 1/2","item_condition":"Survivor "},{"_id":"0cd56f90-97f8-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:21:58.000Z","updated_at":"2021-04-07T23:22:01.000Z","thumbnail":"0dd26d30-97f8-11eb-b224-ade22a8408a3.jpeg","item_type":"test","year":0,"make":"","model":"","title":"","url_title":"0----DyBnRaXSo","sold":false,"stock":"","vin":"","mileage":0,"price":0,"description":"","color":"","engine":"","transmission":"","options":"","item_condition":""},{"_id":"0406fdb0-97f9-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:28:53.000Z","updated_at":"2021-04-07T23:28:56.000Z","thumbnail":"052ba790-97f9-11eb-b224-ade22a8408a3.jpeg","item_type":"Parts","year":0,"make":"Parts","model":"","title":" Parts Available at Giordano’s Vintage Motors","url_title":"0-Parts--parts-available-at-giordano-s-vintage-motors-PeYdttW19","sold":false,"stock":"","vin":"","mileage":0,"price":0,"description":"We have a large inventory of new and used automotive parts, both domestic and foreign.  Currently, our largest parts inventory includes Porsche, Jaguar, Austin Healey, MG, Lucas New Old Stock parts for all British Automobiles 1938-1976 and Ford and Chrysler Engines and transmissions.  We will be greatly expanding the parts section of this website soon. Contact us for your parts needs. Email Jim at gio@sprynet.com or call: 425-333-5600 ","color":"","engine":"","transmission":"","options":"","item_condition":""},{"_id":"e59a0f40-97f6-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:13:43.000Z","updated_at":"2021-04-07T23:13:51.000Z","thumbnail":"e890e110-97f6-11eb-b224-ade22a8408a3.jpeg","item_type":"Cars","year":1952,"make":"Chevrolet Convertible","model":"","title":"0","url_title":"1952-Chevrolet-Convertible--0-qMEAD-pN5","sold":true,"stock":"","vin":"","mileage":0,"price":0,"description":"Recently SOLD","color":"","engine":"","transmission":"","options":"","item_condition":""},{"_id":"05bc75e0-97f9-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:28:56.000Z","updated_at":"2021-04-07T23:28:56.000Z","thumbnail":"","item_type":"","year":0,"make":"","model":"","title":"","url_title":"0----X_dzh6CZV","sold":false,"stock":"","vin":"","mileage":0,"price":0,"description":"","color":"","engine":"","transmission":"","options":"","item_condition":""},{"_id":"0a9d4f50-97f7-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:14:45.000Z","updated_at":"2021-04-07T23:14:48.000Z","thumbnail":"0bcfdbe0-97f7-11eb-b224-ade22a8408a3.jpeg","item_type":"Parts","year":0,"make":"Austin Healey","model":"100/4, 100-6, 3000 & Sprite","title":"Austin Healey Parts-100/4, 100-6, 3000 & Sprite","url_title":"0-Austin-Healey-100-4-100-6-3000-and-Sprite-austin-healey-parts-100-4-100-6-3000-and-sprite-2qiaeDB6j","sold":false,"stock":"","vin":"","mileage":0,"price":0,"description":"* Inventory of Mechanical, Body, Trim, Lucas, and other parts\n\n* Featured parts include 100/ early 3000  Bonnets, doors, fenders, Rear BT7 Alloy cowls & OD BN4 Trans.\n\n* Large Selection of Bugeye and Later Sprite/Midget Parts!\n\nPartial list of parts by model:\n\nBig Healey Parts:  100/4. Folding Top Frame VG cond.   Transmission Tunnel - VG condition.  Grill (w/out surround trim) Good\n\n100/6 & Early 3000: SHortblock Core Engine w/out head. $450.   Cylinder head (2). ,BN4 Overdrive Transmission: $1250-1350.   2 Alum Rear Shrouds (4 seat) Good Condition: 1150 ea, Bonnet/hood, Doors-Several. Decent to Good condition (5). Front Fenders VG (pair),  Brake drums-misc.\n\nMisc Body, trim, electrical and mechanical parts.\n\n3000/BJ8. Bonnet/hood (2)   Misc parts.\n\n \n\nInquire-Prices will be available on Website at a later date\n\nWe stock a large selection of Big Healey and Sprite parts. Engines, transmissions, body panels, mechanical and brake parts, trim, glass, and other misc new and used parts.\n\nHighlights:\n\n* Inventory of Mechanical, Body, Trim, Lucas, and other parts\n\n* Featured parts include 100/ early 3000 Bonnets, doors, fenders, Rear BT7 Alloy cowls & OD BN4 Trans.\n\n* Large Selection of Bugeye and Later Sprite/Midget Parts!\n\nOur Inventory of parts with some photos and prices will be available on this website soon. Shown is a small selection of available parts. Check back and see our selection. Call us with your specific parts needs.","color":"","engine":"","transmission":"","options":"","item_condition":""},{"_id":"0a19c770-97f7-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:14:44.000Z","updated_at":"2021-04-07T23:14:44.000Z","thumbnail":"","item_type":"Artwork","year":0,"make":"Paintings and Prints","model":"","title":"","url_title":"0-Paintings-and-Prints---zTx1P9tRy","sold":false,"stock":"","vin":"","mileage":0,"price":0,"description":"We are representing various automotive theme artists, including Ryan Hill, a talented artist working in the medium of oil on canvas, capturing striking portions of some of the world's best automobiles. More of Ryan's and other artists work are on display in our showroom, and will be available online soon.","color":"","engine":"","transmission":"","options":"","item_condition":""},{"_id":"063f6180-97f9-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:28:57.000Z","updated_at":"2021-04-07T23:29:09.000Z","thumbnail":"0cceea70-97f9-11eb-b224-ade22a8408a3.jpeg","item_type":"Cars","year":1964,"make":"Duke of Earl","model":"","title":" 1964 Alloy-Bodied Custom Coupe – “Duke of Earl”","url_title":"1964-Duke-of-Earl--1964-alloy-bodied-custom-coupe-duke-of-earl-9XMBg4nSk","sold":false,"stock":"","vin":"","mileage":0,"price":0,"description":"Our 1964 Duke of Earl custom alloy-hand panel beated aluminum bodied coupe is based on early 60’s Triumph Spitfire Mk1 chassis and drivetrain. Epson created his unique coupe body with flowing curves and styling cues reminiscent of show and TV cars of the 1960’s. The alloy coupe is Earl’s only hardtop; his other 4 custom cars are aluminum-bodied roadsters built between 1962-1965. Notable design features of the coupe include gullwing doors, side pop-up headlights, and a streamlined aluminum body with oval side and rear windows. All 5 of Earl’s cars exist, with the Le May museum in Tacoma, WA a notable, multiple car owner. This coupe was Mr. Epson’s personal car, and he commuted from his home in Stanwood to his job in Everett, attracting considerable attention. Mr. Epson, who passed away a few years ago, was a talented designer, fabricator and auto restorer, specializing in panel beaten aluminum bodies and hand made parts. He was hired by the Mercedes Benz museum in Stuttgart, Germany to create an authentic hand formed metal parts for one of Hitler’s staff cars. The restoration of this car will undertaken by Jim Giordano, Dan Rogerson and Fred Vosk of Giordano’s Vintage Motors, and Gary Anderson, the car’s previous owner. Gary spent considerable time with Earl in his last few years. The Duke of Earl is presently being restored to driving condition. Mrs. Epson’s Earl roadster was involved in an accident, and Earl used his coupe’s front suspension assembly to repair her car. We are using parts from our Triumph Spitfire Mk1, an ex GT-6 powered, SCCA race car as donor to replace these missing parts. Future work may include installing an orange and white, 70’s style custom interior. Earl Epson is a unique local talent whose creative automotive designs and craftsmanship is deserving of attention. We look forward to displaying this car in our showroom, and at car events throughout the Northwest.","color":"","engine":"","transmission":"","options":"","item_condition":""},{"_id":"d54716c0-fcb8-11eb-aab0-b105eb4f377c","created_at":"2021-08-14T04:33:54.000Z","updated_at":"2022-06-13T02:31:32.000Z","thumbnail":"6ee68cf0-fd56-11eb-a6cf-23026426946c.jpeg","item_type":"Cars","year":1978,"make":"Porsche","model":"911SC","title":"Clear WA Title","url_title":"1978-Porsche-911SC-clear-wa-title-8lLcNQ8Vf","sold":true,"stock":"78POR911SCMRVBL01","vin":"9118201380","mileage":0,"price":0,"description":"SOLD   1978 Porsche 911SC Minerva Blue 5spd Coupe","color":"","engine":"","transmission":"","options":"","item_condition":""},{"_id":"33f4fff0-97f8-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:23:04.000Z","updated_at":"2021-04-07T23:23:09.000Z","thumbnail":"36475460-97f8-11eb-b224-ade22a8408a3.jpeg","item_type":"Cars","year":1966,"make":"Honda","model":"S600","title":" 1966 Honda S600 Roadster Project Car RHD Japan Market Car","url_title":"1966-Honda-S600-1966-honda-s600-roadster-project-car-rhd-japan-market-car-leeqhV8ge","sold":false,"stock":"","vin":"","mileage":0,"price":0,"description":"Dry Climate, Barn-Find 1966 Honda S600 Roadster in very restorable condition. Appears to be a Japan or Asia market car-its right hand drive, and dataplate is in Japanese. Originally Red paint with black interior.\nCurrently black primer.  Previous owner installed a BMC Austin Healey Sprite 948cc 4 cylinder engine and 4spd transmission apparently driving through the stock chain drive rear end!\nWell engineered. Nearly complete car.\nBody looks worse than it is. Floors, trunk and unibody are in overall very good condition, with some minor rust through on lower body. I think the very available, Honda N600 or z600 engine and transmissions will fit in this car, if owner wants to return to more original drivetrain. We are considering upgrading to a more powerful, Honda Motorcycle or small car engine. \nCurrently accepting offers on this valuable, rare early Honda Roadster. ","color":"Original","engine":"BMC-Austin Healey 948cc","transmission":"BMC 4 spd manual","options":"","item_condition":"Barn Find car for restoration\n"},{"_id":"5a04c530-2138-11ec-9b82-115c32456ef3","created_at":"2021-09-29T15:17:25.000Z","updated_at":"2021-12-15T20:38:17.000Z","thumbnail":"e2cc2e80-2138-11ec-9b82-115c32456ef3.jpeg","item_type":"Cars","year":1973,"make":"chevrolet","model":"SOLD   Corvette 4 spd Convertible","title":"Clear WA Title","url_title":"1973-chevrolet-SOLD-Corvette-4-spd-Convertible-clear-wa-title-7NMh7o9lL","sold":true,"stock":"SOLD   73CORVETTECVT01","vin":"1Z67T3S406191","mileage":36020,"price":0,"description":"Recently SOLD    1973 Corvette C3 4spd Convertible.  ","color":"","engine":"","transmission":"","options":"See description above please","item_condition":""},{"_id":"4b801c30-97f9-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:30:53.000Z","updated_at":"2021-04-07T23:31:03.000Z","thumbnail":"50d21c10-97f9-11eb-b224-ade22a8408a3.jpeg","item_type":"Parts","year":0,"make":"Austin Healey","model":"","title":"Austin Healey Doors","url_title":"0-Austin-Healey--austin-healey-doors-THAuNcHvC","sold":false,"stock":"","vin":"","mileage":0,"price":0,"description":"TBD, or make reasonable offer\n\nTwo left hand doors.  \nOne in good Condition orange in color no glass, or handles.  Also has some minor rust, as well as some damage.\n\nSecond has a good amount of rust mostly just on the surface, though there are some holes.\n\nMore doors to be added later.\n\n","color":"","engine":"","transmission":"","options":"","item_condition":""},{"_id":"4a1134d0-97f7-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:16:32.000Z","updated_at":"2021-04-07T23:16:42.000Z","thumbnail":"4f44b030-97f7-11eb-b224-ade22a8408a3.jpeg","item_type":"cars","year":1956,"make":"Ford","model":"SOLD   F100 Custom Panel Van/Truck","title":"Restored F100 Panel-Street Rod / Commercial/Food Vending ","url_title":"1956-Ford-SOLD-F100-Custom-Panel-Van-Truck-restored-f100-panel-street-rod-commercial-food-vending-7tWieeCxm","sold":true,"stock":"56F100PAN01","vin":"F19D6046008","mileage":0,"price":0,"description":"Recently SOLD 1956F100 Custom Panel Van/Truck.\nTerrific, multi-purpose mild custom with unique, pro-built sliding steel bed - motorcycle hauler, run Appliances with power converter system onboard, and more!  This Panel Truck features Air Conditioning, power steering, Power Disk front brakes, digital dash, custom interior, and much more.  Low rust, professionally built California custom by noted rod shop. Note. graphics on sid of rear panels are removable.  Ready to cruise, haul motorcycles or commercial uses such as food vending truck, promotional events, swap meets or...Slide out bed and large areas for graphics provide terrific commercial or hobby applications.  ","color":"white","engine":"Chev 350","transmission":"Chev Auto","options":"","item_condition":"Very good overall condition "},{"_id":"3a9a81e0-97f8-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:23:15.000Z","updated_at":"2021-04-07T23:23:21.000Z","thumbnail":"3bc434d0-97f8-11eb-b224-ade22a8408a3.jpeg","item_type":"Cars","year":1969,"make":"Porsche","model":"911E SOLD","title":" SOLD  1969 Porsche 911E Targa : Recent SALE","url_title":"1969-Porsche-911E-SOLD-sold-1969-porsche-911e-targa-recent-sale-Qa0QbIpCs","sold":false,"stock":"69P911ETAR01","vin":"119210285","mileage":0,"price":0,"description":"This is an excellent example of a 1969 911E Targa - Recent Sale","color":"","engine":"","transmission":"","options":"","item_condition":"Overall Excellent Condition."},{"_id":"3a2a8c90-97f9-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:30:24.000Z","updated_at":"2021-04-07T23:30:46.000Z","thumbnail":"46345de0-97f9-11eb-b224-ade22a8408a3.jpeg","item_type":"Parts","year":0,"make":"Porsche","model":"911 912 356 964 914 928 944","title":"Parts for Sale: 911 912 356 964 914 928 944","url_title":"0-Porsche-911-912-356-964-914-928-944-parts-for-sale-911-912-356-964-914-928-944-Lj2ha--bP","sold":false,"stock":"","vin":"","mileage":0,"price":0,"description":"GVM has a large inventory of new and used Porsche 911 912 356 914 928 944 parts.   Parts for sale include engines,\ntransmission, mechanical parts, body parts, interiors, (20 sets of seats), electrical (guages, switches, etc), trim, bumpers, and much more. Contact Jim at 425 985 4259 Text or Call, or email   info@giocars.com with your parts inquiries. ","color":"","engine":"","transmission":"","options":"","item_condition":""},{"_id":"7cfc87a0-97ed-11eb-b224-ade22a8408a3","created_at":"2021-04-07T22:06:22.000Z","updated_at":"2022-06-13T02:33:16.000Z","thumbnail":"7e202010-97ed-11eb-b224-ade22a8408a3.jpeg","item_type":"Cars","year":1980,"make":"Porsche","model":"911SC","title":"1980 Porsche 911SC Slant Nose Sunroof Coupe – Turbo Look All Steel Body. An exciting, great driving sports car","url_title":"1980-Porsche-911SC-1980-porsche-911sc-slant-nose-sunroof-coupe-turbo-look-all-steel-lKvodP8N6","sold":false,"stock":"80911SCSLNT01","vin":"91A0143612","mileage":0,"price":0,"description":"\nSOLD!   Recent Sale  ","color":"","engine":"","transmission":"","options":"","item_condition":""},{"_id":"3a179740-97ed-11eb-b224-ade22a8408a3","created_at":"2021-04-07T22:04:30.000Z","updated_at":"2021-06-09T15:19:50.000Z","thumbnail":"5eecfa10-bc4b-11eb-916a-a73da7d74579.jpeg","item_type":"","year":0,"make":"","model":"","title":"","url_title":"0----bUbn8M0Vy","sold":false,"stock":"","vin":"","mileage":0,"price":0,"description":"","color":"","engine":"","transmission":"","options":"","item_condition":""},{"_id":"8efaa7c0-97f7-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:18:27.000Z","updated_at":"2021-04-07T23:18:27.000Z","thumbnail":"0733fde0-3b37-11eb-b029-ddae8029bd8d.jpeg","item_type":"Cars","year":1967,"make":"Ford","model":"Mustang GTA Convertible","title":"1967 Ford Mustang Factory GTA -Many Options","url_title":"1967-Ford-Mustang-GTA-Convertible-1967-ford-mustang-factory-gta-many-options-Fs3db3zaE","sold":true,"stock":"67MUSTGTACVT01","vin":"","mileage":0,"price":0,"description":"SOLD \nVIN  7T03C154664 SOLD \nDeluxe Marti Report Details:   \n\nDOOR DATA PLATE INFORMATION Serial Number 7T03C154664 7 1967 T Built at Metuchen 03 Mustang 2-Door Convertible C 289-2V V-8 Engine 154664 Serial Number of this Ford scheduled for production at Metuchen 76B Mustang Decor 2-Door Convertible Y Dark Moss Green Paint, Ford #2039-A 6A Black Vinyl Luxury Bucket Seats 29L Scheduled for build November 29, 1966 17 Washington DSO (District Sales Office) 1 3.00 Conventional Rear Axle W C-4 Select Shift Automatic Transmission  \n\nSTATISTICS   Your vehicle was one of: 4,315 With this Paint Code 196 With these Paint/Trim Codes 22,304 With these Engine/Transmission Codes 2,129 Ordered from this DSO 2,341 With GT Equipment Group For the 1967 Mustang 2-Door Convertible Your vehicle was equipped with the following features: - White Power Top w/Plastic Backlite - GT Equipment Group - F70-14 Wide Oval White Sidewall Nylon Tires - Rocker Panel Moldings - Console - Deluxe Steering Wheel - Power Steering - AM Radio - Exterior Decor Group - Interior Decor Group - Deluxe Seat Belts - Wheel Covers \n\nORDER TYPE: RETAIL DSO ITEM #: 1757 DEALER #: 17A009 HERBYS INC 1600 DUKE STREET ALEXANDRIA VA 22314 IMPORTANT DATES ORDER RECEIVED: 11/16/66 CAR SERIALIZED: 11/16/66 BUCKED: -- SCHEDULED FOR BUILD: 11/29/66 ACTUALLY BUILT: 11/30/66 RELEASED: 11/30/66 SOLD: 12/13/66 IMPORTANT DATES ORDER RECEIVED: 11/16/66 CAR SERIALIZED: 11/16/66 BUCKED: -- SCHEDULED FOR BUILD: 11/29/66 ACTUALLY BUILT: 11/30/66 RELEASED: 11/30/66 SOLD: 12/13/66 \n\nAbout the 1967 Mustang GTA Model:  The most desirable and valuable of the first-generation Mustangs are those from the 1967 and 1968 model years. These years represents the sweet spot, with the car’s classic style and compact (by American standards) size teamed with much better cosmetic, interior and mechanical specifications. 1967 Mustang Convertibles, especially with the GT Trim package are some of the most collectable, sought after mid-range American collectable cars from the 1960s. Terrific style, great parts availability, club support and low cost of ownership help to keep prices generally high and all 1967 Mustang models remain in steady and high demand. Appraiser’s Notes: The first impression I had of this car when the owner drove it to our dealership was of a remarkably original and well optioned Mustang, carefully maintained and kept in very good driving condition.  \n\n\n\nLocated in Carnation, WA at Giordano''s Vintage Motors. We Buy, Sell, Consign and Trade Sports, Muscle, Collector Cars and Rods, Motorcycles, Parts and collectables. Come visit our indoor showroom or view our inventory online at www.giocars.com. As well as actively buying and trading vehicles, we welcome consigned vehicles, and offer low consignment sales commissions and no consignment fees, putting more money back in your pocket. We are experts at locating and appraising vehicles, and can help value your vehicle for insurance, estate settlement or in preparation for selling. We have hundreds of satisfied customers, and will work hard to earn your trust. You can visit our showroom at 4501 Tolt Avenue, Carnation, WA 98014. Or view our website at: www.giocars.com. You can email us or call Jim at 425-333-5600. We hope to hear from you! VIN posted at dealership.\n\nThe price for this vehicle as equipped does not include charges such as: License, Title, Registration Fees, State or Local Taxes, Finance Charges, Credit Investigation, Optional Credit Insurance, Physical Damage or Liability Insurance, Delivery Fees, or a negotiable $100 Documentary Service Fee. This website and Dealership makes no representations, expressed or implied, to any actual or prospective purchaser or owner of this vehicle as to the existence, ownership, accuracy, description or condition of this vehicle's listed equipment, accessories, price or any warranties. Any and all differences must be addressed prior to the sale of this vehicle.","color":"Dark Moss Green ","engine":"289 V8 ","transmission":"Auto","options":"Numerous.  See Ad description","item_condition":"Very good overall"},{"_id":"b402d460-97f8-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:26:39.000Z","updated_at":"2021-04-07T23:27:47.000Z","thumbnail":"dbab91f0-97f8-11eb-b224-ade22a8408a3.jpeg","item_type":"cars","year":1956,"make":"Oldsmobile","model":"Super 88 4 door Hardtop ","title":"Restoration / Fabrication/Upgrades Photos","url_title":"1956-Oldsmobile-Super-88-4-door-Hardtop-restoration-fabrication-upgrades-photos-Quho-w6ly","sold":true,"stock":"","vin":"","mileage":0,"price":0,"description":"Photos of Restoration / Fabrication/Upgrades - in progress photos showing custom front suspension, power disk brakes, interior and exterior restoration and more...a great looking Olds Super88...","color":"","engine":"","transmission":"","options":"","item_condition":""},{"_id":"9464a700-97f8-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:25:46.000Z","updated_at":"2021-04-07T23:25:46.000Z","thumbnail":"","item_type":"","year":0,"make":"","model":"","title":"","url_title":"0----I7L6cBi13","sold":false,"stock":"","vin":"","mileage":0,"price":0,"description":"","color":"","engine":"","transmission":"","options":"","item_condition":""},{"_id":"94ef81e0-97f8-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:25:47.000Z","updated_at":"2021-04-07T23:25:55.000Z","thumbnail":"99978620-97f8-11eb-b224-ade22a8408a3.jpeg","item_type":"Motorcycles","year":1993,"make":"Kawasaki","model":"ZG1000A8","title":"1993 Kawasaki ZG1000A8 Concour – Great Performing Sport Tourer","url_title":"1993-Kawasaki-ZG1000A8-1993-kawasaki-zg1000a8-concour-great-performing-sport-tourer-6oW_U9s9G","sold":false,"stock":"","vin":"JKAZGCA17PB507563.","mileage":31000,"price":0,"description":" A great looking and riding Concour.  VIN JKAZGCA17PB507563. Indicated Miles: 31,000. Factory Gold and black Paint still in nice shape. Includes rack and matched hardbags/paniers. Some cosmetic flaws, and small dent in gas tank. Previous owner did long cross country tours on this bike, with trouble-free miles.   Better photos on the way soon. No detailing was done to bike when photos taken...bike will clean up very nicely.","color":"Now Gold/Black","engine":"1100CC","transmission":"","options":"","item_condition":""},{"_id":"2b2eb650-97f7-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:15:40.000Z","updated_at":"2021-04-07T23:16:02.000Z","thumbnail":"37df00d0-97f7-11eb-b224-ade22a8408a3.jpeg","item_type":"Motorcycles","year":1974,"make":"Kawasaki","model":"Z1 900cc","title":"1974 Kawasaki Z1 900cc Original Bike. “Garage-Find” condition","url_title":"1974-Kawasaki-Z1-900cc-1974-kawasaki-z1-900cc-original-bike-garage-find-condition-jji7OPl4d","sold":true,"stock":"","vin":"Z1F48836","mileage":27460,"price":0,"description":"1974 Kawasaki Z1 900cc Original Bike. \"Garage-Find\" condition - $6500 complete, 27,400 original mile Z1. VIN. Z1F48836 Engine No. Z1E-048850 Original Factory Tool kit. Incorrect 2 person seat appears to have original good condition seat frame. Correct Style solo seat included but not show in photo. Spare plastic rear ","color":"Black","engine":"900cc 4 carb","transmission":"Manual","options":"2 Person seat, Toolkit.","item_condition":"Overall Good condition. Prev. owner lost keys, so not running."},{"_id":"a5d6e660-97f8-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:26:15.000Z","updated_at":"2021-04-07T23:26:15.000Z","thumbnail":"3be18700-4698-11e9-bf64-97c5814b1e51--5256146851_3547c2a3cc_m.jpg","item_type":"Models/Kits","year":0,"make":"Model Kits","model":"","title":" Diecast Vehicles-Cars, Trucks & Motorcycles. Huge Inventory","url_title":"0-Model-Kits--diecast-vehicles-cars-trucks-and-motorcycles-huge-inventory-RZ0f8WcgX","sold":false,"stock":"","vin":"","mileage":0,"price":0,"description":"We have hundreds of Diecast on display, from 1/64th scale up to 1/8th scale.  We focus on 1/18, 1/24 , 1/32 and 1/64 scale diecast collectables and toys. All the major brands, and plenty of rare and unusual vehicles as well.  Our Ferrari and American Muscle Car Inventory is very extensive. New, and Pre-Owned diecast at sensible prices. Drop by our Showroom in Carnation or let us know what you are looking for.  These make great presents for that hard to shop for car enthusiast!  Also loads of plastic model kits, and some tin toys going back to the ,40s and '50s.   We also buy collections of diecast as well.","color":"","engine":"","transmission":"","options":"","item_condition":""},{"_id":"a65d2d60-97f8-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:26:16.000Z","updated_at":"2021-04-07T23:26:20.000Z","thumbnail":"a7b395a0-97f8-11eb-b224-ade22a8408a3.jpeg","item_type":"test","year":0,"make":"","model":"","title":"","url_title":"0----SyLJyM-pj","sold":false,"stock":"","vin":"","mileage":0,"price":0,"description":"","color":"","engine":"","transmission":"","options":"","item_condition":""},{"_id":"28ae25f0-97f7-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:15:36.000Z","updated_at":"2021-04-07T23:15:38.000Z","thumbnail":"29bbec70-97f7-11eb-b224-ade22a8408a3.jpeg","item_type":"test","year":0,"make":"","model":"","title":"","url_title":"0----x4OBkPCeT","sold":false,"stock":"","vin":"","mileage":0,"price":0,"description":"","color":"","engine":"","transmission":"","options":"","item_condition":""},{"_id":"ab485520-97f8-11eb-b224-ade22a8408a3","created_at":"2021-04-07T23:26:24.000Z","updated_at":"2021-04-07T23:26:27.000Z","thumbnail":"ac5a8870-97f8-11eb-b224-ade22a8408a3.jpeg","item_type":"cars","year":1958,"make":"Messerschmitt ","model":"kr200 kabinenrolle Cabriolet","title":"","url_title":"1958-Messerschmitt-kr200-kabinenrolle-Cabriolet--KPZS7ccMZ","sold":false,"stock":"58MESKAB01","vin":"","mileage":0,"price":0,"description":"\n1958 Messerschmitt kr200 kabinenroller project..presently partially \"converted\" to a Tiger 4 wheel car, which is the sports car, 4 wheel car..No drivetrain, but we have lots of ideas of how to complete this car\n","color":"red and other patina colors including surface rust","engine":"none","transmission":"none","options":"","item_condition":"Good condition body, Incomplete"}]